-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023 年 10 月 23 日 17:07
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `team3final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `book`
--

CREATE TABLE `book` (
  `book_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `book_date` date NOT NULL,
  `book_time` time NOT NULL,
  `book_num_adult` int(2) NOT NULL,
  `book_num_kid` int(2) NOT NULL,
  `book_name` varchar(50) NOT NULL,
  `book_gender` int(1) NOT NULL,
  `book_phone` varchar(30) NOT NULL,
  `book_email` varchar(50) NOT NULL,
  `book_note` varchar(200) NOT NULL,
  `book_create_time` datetime NOT NULL,
  `book_isValid` int(1) NOT NULL DEFAULT 1,
  `book_notification` int(100) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `book`
--

INSERT INTO `book` (`book_id`, `user_id`, `restaurant_id`, `book_date`, `book_time`, `book_num_adult`, `book_num_kid`, `book_name`, `book_gender`, `book_phone`, `book_email`, `book_note`, `book_create_time`, `book_isValid`, `book_notification`) VALUES
(1, 5, 1, '2023-11-16', '13:00:00', 2, 1, '洪琪方', 0, '0943895663', 'apple980750@gmail.com', '不要香菜,\r\n對海鮮過敏.', '2023-10-02 15:28:19', 1, 1),
(2, 3, 2, '2023-11-07', '17:00:00', 4, 0, '邱振澤', 1, '0976542990', '035424chiu@gmail.com', '商務聚餐,\n希望能安排方便談話,不受打擾的位置.', '2023-10-03 11:33:05', 1, 0),
(4, 22, 4, '2023-11-19', '13:00:00', 2, 0, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '想坐靠窗, 希望空調溫度不要太低.', '2023-10-14 00:41:54', 1, 1),
(10, 22, 6, '2023-10-03', '12:00:00', 2, 2, '蘇映如', 2, '0912345678', 'yingjumr@gmail.com', '我很怕冷,\n冷氣不要太強', '2023-10-17 01:04:08', 1, 1),
(14, 22, 1, '2023-10-22', '14:00:00', 3, 2, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '我很怕冷,\n冷氣不要太強', '2023-10-17 17:54:06', 0, 1),
(15, 22, 1, '2023-11-04', '15:00:00', 1, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '我很怕冷,\n冷氣不要太強', '2023-10-17 17:57:55', 0, 1),
(16, 22, 1, '2023-11-11', '12:00:00', 3, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '我很怕冷,\n冷氣不要太強', '2023-10-17 18:01:34', 0, 1),
(17, 22, 11, '2023-10-07', '15:00:00', 2, 0, '蘇映如', 2, '0912345678', 'yingjumr@gmail.com', '我很怕冷, 冷氣不要太強', '2023-10-17 20:13:56', 1, 1),
(18, 22, 1, '2023-10-19', '20:00:00', 2, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '我很怕冷, 冷氣不要太強', '2023-10-17 21:04:30', 1, 1),
(19, 22, 3, '2023-11-15', '19:00:00', 3, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '因為有小孩,\n請幫我準備兒童餐具, 謝謝.', '2023-10-18 03:20:27', 1, 1),
(20, 22, 1, '2023-10-21', '13:00:00', 1, 2, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '請幫我準備兒童餐具,\n謝謝!', '2023-10-18 11:19:33', 0, 1),
(21, 22, 1, '2023-10-22', '16:00:00', 3, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '我很怕冷,\n請給我不是風口的位子喔!', '2023-10-18 11:30:24', 0, 1),
(22, 22, 7, '2023-11-10', '17:00:00', 1, 2, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '麻煩幫我準備兒童餐具,\n謝謝囉~', '2023-10-18 11:48:21', 1, 1),
(25, 22, 3, '2023-10-23', '19:00:00', 2, 0, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '', '2023-10-22 15:49:55', 1, 1),
(28, 22, 2, '2023-11-01', '12:00:00', 2, 0, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '', '2023-10-23 12:22:41', 1, 1),
(29, 3, 2, '2023-11-07', '17:00:00', 4, 0, '邱振澤', 1, '0976542990', '035424chiu@gmail.com', '商務聚餐, 希望能安排方便談話, 不受打擾的位置.', '2023-10-03 11:33:05', 1, 1),
(30, 4, 2, '2023-11-08', '18:00:00', 3, 2, '王小明', 1, '0987654321', 'wang@example.com', '家庭聚餐, 需要高腳椅.', '2023-10-04 12:45:20', 1, 1),
(31, 5, 2, '2023-11-09', '19:00:00', 2, 1, '陳美美', 0, '0933333333', 'chen@example.com', '生日慶祝, 需要蛋糕.', '2023-10-05 14:22:10', 1, 1),
(32, 6, 2, '2023-11-10', '20:00:00', 6, 4, '李大魁', 1, '0912345678', 'li@example.com', '朋友聚會, 不吃辣.', '2023-10-06 09:15:30', 1, 1),
(33, 7, 2, '2023-11-11', '21:00:00', 5, 0, '張小花', 0, '0909090909', 'zhang@example.com', '晚餐約會, 浪漫氛圍.', '2023-10-07 17:55:45', 1, 1),
(34, 8, 2, '2023-11-12', '18:30:00', 2, 0, '陳大山', 1, '0988888888', 'chen@example.com', '生日慶祝, 需要蛋糕.', '2023-10-08 13:20:15', 1, 1),
(35, 9, 2, '2023-11-13', '19:15:00', 3, 1, '林小枝', 0, '0977777777', 'lin@example.com', '家庭聚餐, 需要高腳椅.', '2023-10-09 10:05:30', 1, 1),
(36, 10, 2, '2023-11-14', '20:00:00', 5, 2, '張小風', 1, '0966666666', 'zhang@example.com', '朋友聚會, 不吃辣.', '2023-10-10 08:45:40', 1, 1),
(37, 11, 2, '2023-11-15', '21:30:00', 2, 0, '吳大海', 1, '0955555555', 'wu@example.com', '晚餐約會, 浪漫氛圍.', '2023-10-11 16:30:55', 1, 1),
(38, 12, 2, '2023-11-16', '22:00:00', 4, 3, '黃小芳', 0, '0944444444', 'huang@example.com', '商務聚餐, 希望能安排方便談話.', '2023-10-12 19:15:10', 1, 1),
(39, 13, 2, '2023-11-20', '18:30:00', 2, 0, '劉小雲', 0, '0988888888', 'liu@example.com', '生日慶祝, 需要蛋糕.', '2023-10-18 13:20:15', 1, 1),
(40, 14, 2, '2023-11-21', '19:15:00', 3, 1, '陳小琪', 1, '0977777777', 'chen@example.com', '家庭聚餐, 需要高腳椅.', '2023-10-19 10:05:30', 1, 1),
(41, 15, 2, '2023-11-22', '20:00:00', 5, 2, '王大牛', 1, '0966666666', 'wang@example.com', '朋友聚會, 不吃辣.', '2023-10-20 08:45:40', 1, 1),
(42, 16, 2, '2023-11-23', '21:30:00', 2, 0, '張小龍', 1, '0955555555', 'zhang@example.com', '晚餐約會, 浪漫氛圍.', '2023-10-21 16:30:55', 1, 1),
(43, 17, 2, '2023-11-24', '22:00:00', 4, 3, '李小夢', 0, '0944444444', 'li@example.com', '商務聚餐, 希望能安排方便談話.', '2023-10-22 19:15:10', 1, 1),
(44, 22, 2, '2023-11-22', '18:00:00', 3, 1, '蘇映如', 0, '0912345678', 'yingjumr@gmail.com', '', '2023-10-23 18:34:28', 0, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `collection`
--

CREATE TABLE `collection` (
  `collection_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='收藏商品多對多';

--
-- 傾印資料表的資料 `collection`
--

INSERT INTO `collection` (`collection_id`, `user_id`, `product_id`) VALUES
(3, 10, 34),
(18, 10, 29),
(56, 35, 39),
(147, 35, 62),
(148, 35, 29),
(149, 35, 33),
(150, 35, 47),
(151, 2, 64);

-- --------------------------------------------------------

--
-- 資料表結構 `followers`
--

CREATE TABLE `followers` (
  `followers_id` int(11) NOT NULL,
  `user_id_followed` int(11) NOT NULL,
  `user_id_following` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `followers`
--

INSERT INTO `followers` (`followers_id`, `user_id_followed`, `user_id_following`) VALUES
(1, 22, 1),
(3, 22, 3),
(4, 22, 4),
(5, 22, 5),
(6, 22, 6),
(7, 22, 7),
(8, 22, 8),
(9, 22, 9),
(10, 22, 10),
(11, 22, 11),
(12, 22, 12),
(13, 22, 13),
(14, 22, 14),
(15, 22, 15),
(16, 22, 16),
(17, 22, 17),
(18, 22, 18),
(19, 22, 19),
(20, 22, 20),
(21, 22, 21),
(31, 3, 22),
(32, 4, 22),
(39, 1, 22);

-- --------------------------------------------------------

--
-- 資料表結構 `food_tag`
--

CREATE TABLE `food_tag` (
  `food_tag_id` int(11) NOT NULL,
  `food_tag_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `food_tag`
--

INSERT INTO `food_tag` (`food_tag_id`, `food_tag_name`) VALUES
(1, '台式'),
(2, '中式'),
(3, '日式'),
(4, '韓式'),
(5, '港式'),
(6, '美式'),
(7, '義式'),
(8, '法式'),
(9, '西式'),
(10, '泰式'),
(11, '越式'),
(12, '火鍋'),
(13, '燒烤'),
(14, '牛排'),
(15, '熱炒'),
(16, '素食'),
(17, '飲品'),
(18, '酒吧'),
(19, '咖啡廳'),
(20, '炸物'),
(21, '吃到飽'),
(22, '小吃'),
(23, '甜點'),
(24, '早餐'),
(25, '早午餐'),
(26, '午餐'),
(27, '下午茶'),
(28, '晚餐');

-- --------------------------------------------------------

--
-- 資料表結構 `likes`
--

CREATE TABLE `likes` (
  `like_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `likes`
--

INSERT INTO `likes` (`like_id`, `user_id`, `post_id`) VALUES
(1, 1, 26),
(2, 2, 26),
(3, 3, 26),
(4, 4, 26),
(5, 5, 26),
(6, 6, 26),
(7, 7, 26),
(8, 8, 26),
(9, 9, 26),
(10, 10, 26),
(11, 1, 1),
(12, 1, 15),
(13, 11, 26),
(14, 1, 27),
(15, 1, 33),
(16, 1, 34),
(17, 1, 36),
(18, 1, 37),
(19, 1, 38),
(20, 1, 43),
(21, 12, 1),
(22, 12, 15),
(23, 12, 26),
(24, 12, 27),
(25, 12, 33),
(26, 12, 34),
(27, 12, 36),
(28, 12, 37),
(29, 12, 38),
(30, 12, 43),
(31, 3, 36),
(32, 3, 37),
(33, 3, 38),
(34, 3, 43),
(35, 4, 38),
(36, 4, 43),
(37, 2, 2),
(38, 2, 45),
(40, 11, 1),
(41, 11, 2),
(42, 11, 3),
(43, 9, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `menu_img`
--

CREATE TABLE `menu_img` (
  `menu_img_id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `menu_img_route` varchar(30) NOT NULL,
  `menu_img_isValid` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `menu_img`
--

INSERT INTO `menu_img` (`menu_img_id`, `restaurant_id`, `menu_img_route`, `menu_img_isValid`) VALUES
(1, 1, 'r1-menu1.jpg', 1),
(2, 2, 'r2-menu1.jpg', 1),
(3, 2, 'r2-menu2.jpg', 1),
(4, 2, 'r2-menu3.jpg', 1),
(5, 2, 'r2-menu4.jpg', 1),
(6, 2, 'r2-menu5.jpg', 1),
(7, 3, 'r3-menu1.png', 1),
(8, 4, 'r4-menu1.jpeg', 1),
(9, 4, 'r4-menu2.jpeg', 1),
(10, 4, 'r4-menu3.jpeg', 1),
(11, 4, 'r4-menu4.jpeg', 1),
(12, 5, 'r5-menu1.jpg', 1),
(13, 5, 'r5-menu2.jpg', 1),
(14, 6, 'r6-menu1.jpg', 1),
(15, 6, 'r6-menu2.jpg', 1),
(16, 7, 'r7-menu1.jpg', 1),
(17, 7, 'r7-menu2.jpg', 1),
(18, 7, 'r7-menu3.jpg', 1),
(19, 7, 'r7-menu4.jpg', 1),
(20, 8, 'r8-menu1.jpg', 1),
(21, 8, 'r8-menu2.jpg', 1),
(22, 8, 'r8-menu3.jpg', 1),
(23, 8, 'r8-menu4.jpg', 1),
(24, 8, 'r8-menu5.jpg', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `oder_detail`
--

CREATE TABLE `oder_detail` (
  `orderproduct_id` int(11) NOT NULL,
  `order_id` varchar(70) NOT NULL,
  `product_id` int(11) NOT NULL,
  `order_quantity` int(11) NOT NULL,
  `score` int(11) DEFAULT NULL,
  `content` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `oder_detail`
--

INSERT INTO `oder_detail` (`orderproduct_id`, `order_id`, `product_id`, `order_quantity`, `score`, `content`) VALUES
(49, 'e9a4c5eb-3b74-4b71-b8b2-c86dae923229', 29, 2, 3, '滿不錯的哦'),
(60, '6d14b1fb-2a2d-4f51-900f-2897929025db', 38, 3, NULL, ''),
(61, '8e9a7bbd-eb0e-4849-a6fc-98ab0c1b59a9', 29, 2, 2, '外皮不夠酥脆，也沒有焦糖香，內餡偏濕'),
(63, 'c7d0fedf-ed6d-43d5-b01c-0952abfadce0', 32, 2, NULL, ''),
(64, '1ade2b95-9d89-4357-b94f-1ad7adce26ef', 38, 4, NULL, ''),
(65, '035955dc-9c86-4f8d-9a94-caf190d6520c', 29, 2, 4, '好吃送朋友很喜歡~'),
(66, '04706824-940a-4f90-beb3-ada7cf4e6dfc', 29, 1, 5, '味道很濃~cp值超高!'),
(67, '1ade2b95-9d89-4357-b94f-1ad7adce26ef', 36, 1, NULL, ''),
(68, '293cf6bf-702d-4267-af8f-2aa91f8f2f28', 37, 2, NULL, ''),
(69, '6fd76096-1f99-4b85-be39-14e02968213b', 38, 1, NULL, ''),
(70, '8792c14f-9f63-42da-8636-0367183070cf', 39, 3, NULL, ''),
(71, 'aaac1866-7f52-433e-918b-2b2ef158fb94', 40, 3, NULL, ''),
(72, 'e9a4c5eb-3b74-4b71-b8b2-c86dae923229', 41, 3, NULL, ''),
(73, '3cce31ec-f62c-4651-8440-221a5eea7e07', 62, 2, 4, '好吃不會很甜，吃起來滿放心的'),
(74, 'ce2c6b43-9ce8-4ab3-acab-902cba584045', 29, 2, 0, ''),
(75, '123456789', 46, 12, 4, '微偏酸，喝起來滿清爽的'),
(76, '123456789', 46, 12, 4, '微偏酸，喝起來滿清爽的'),
(77, '123456789', 64, 9, 5, '送朋友很喜歡，讚讚'),
(78, '123456789', 27, 8, 4, '不錯吃'),
(79, '123456789', 38, 12, 4, '不錯會回購'),
(80, '123456789', 47, 22, 5, '不會死甜，很喜歡!!!!'),
(81, '123456789', 30, 19, 4, '口感綿密，味道滿濃的~'),
(82, '123456789', 29, 25, 5, '冰冰吃超好吃~~'),
(83, '223456789', 35, 3, 3, '有點甜'),
(84, '223456789', 29, 6, 3, '還ok，裡面有點太濕潤'),
(85, '223456789', 53, 9, 4, '不錯~~滿刷嘴的'),
(86, '323456789', 48, 14, 4, '家人說不錯'),
(87, '423456789', 28, 8, 5, '酸甜酸甜很喜歡'),
(88, '423456789', 29, 7, 5, '吃過屬一屬二的味道!!'),
(89, '423456789', 62, 35, 4, '味道不錯口感很特別~'),
(90, '323456789', 33, 11, 4, '茶香很濃'),
(91, '323456789', 34, 13, 5, '味道很濃郁，冰起來吃很棒~'),
(92, '3ac22c83-2110-4f2f-af49-6b684ce73782', 39, 1, NULL, '');

-- --------------------------------------------------------

--
-- 資料表結構 `order_general`
--

CREATE TABLE `order_general` (
  `order_id` varchar(70) NOT NULL,
  `payment_status` varchar(50) NOT NULL,
  `user_id` int(11) NOT NULL,
  `payment_method` varchar(50) DEFAULT NULL,
  `order_amount` int(30) NOT NULL,
  `delivery_method` varchar(50) NOT NULL,
  `delivery_name` varchar(30) DEFAULT NULL,
  `delivery_phone` varchar(40) DEFAULT NULL,
  `delivery_address` varchar(100) DEFAULT NULL,
  `delivery_status` varchar(50) NOT NULL,
  `order_date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `order_general`
--

INSERT INTO `order_general` (`order_id`, `payment_status`, `user_id`, `payment_method`, `order_amount`, `delivery_method`, `delivery_name`, `delivery_phone`, `delivery_address`, `delivery_status`, `order_date`) VALUES
('035955dc-9c86-4f8d-9a94-caf190d6520c', '已付款', 22, '貨到付款(現金)', 700, '宅配', '溫子涵', '0987650114', '臺中市407西屯區台灣大道三段301號', '已完成', '2023-10-15 10:53:43'),
('04706824-940a-4f90-beb3-ada7cf4e6dfc', '已付款', 10, 'LINE PAY', 1340, '宅配', '丁英洲', '0945773142', '台中市408南屯區大英街607號', '已完成', '2023-10-15 13:42:21'),
('123456789', '已完成', 1, '貨到付款(現金)', 999, '宅配', '沉沉', '0911111111', '新北市萬里區', '已完成', '2023-10-23 12:06:04'),
('1ade2b95-9d89-4357-b94f-1ad7adce26ef', '未付款', 22, '7-11超商取貨付款', 1340, '7-11超商取貨', '白敬亭', '0845442365', '臺北市106大安區瑞安街118號', '備貨中', '2023-10-18 10:39:35'),
('223456789', '已完成', 3, '貨到付款(現金)', 1260, '宅配', '努努', '0933333333', '台北市', '已完成', '2023-10-23 12:06:04'),
('293cf6bf-702d-4267-af8f-2aa91f8f2f28', '已付款', 22, 'LINE PAY', 1360, '宅配', '胡明昊', '0966418456', '基隆市200仁愛區愛二路42號', '備貨中', '2023-10-15 17:40:50'),
('323456789', '已完成', 40, '貨到付款(現金)', 2060, '宅配', '拉拉', '0966666666', '台中市', '已完成', '2023-10-23 12:06:04'),
('3ac22c83-2110-4f2f-af49-6b684ce73782', '已付款', 22, 'LINE PAY', 900, '7-11超商取貨', '艾波', '0955258457', '權鑫門市 台北市大同區民權西路157之1號1樓', '備貨中', '2023-10-23 17:55:55'),
('423456789', '已完成', 17, '貨到付款(現金)', 650, '宅配', '培培', '0912122122', '南投市', '已完成', '2023-10-23 12:06:04'),
('6d14b1fb-2a2d-4f51-900f-2897929025db', '已付款', 36, 'LINE PAY', 1950, '宅配', '張凌赫', '0972051835', '台北市110信義區松仁路97號', '已完成', '2023-10-17 11:34:56'),
('6fd76096-1f99-4b85-be39-14e02968213b', '已付款', 36, 'LINE PAY', 1340, '7-11超商取貨', '汪蘇瀧', '0945562341', '宜蘭縣262礁溪鄉五峰路69號', '備貨中', '2023-10-15 11:08:24'),
('8792c14f-9f63-42da-8636-0367183070cf', '已付款', 36, 'LINE PAY', 320, '宅配', '王一博', '0965342243', '南投縣555魚池鄉文化巷41號', '備貨中', '2023-10-15 19:22:00'),
('8e9a7bbd-eb0e-4849-a6fc-98ab0c1b59a9', '已付款', 112, 'LINE PAY', 1280, '宅配', '肖戰', '0965587343', '台北市106大安區復興南路二段142之1號', '已完成', '2023-10-15 19:17:31'),
('aaac1866-7f52-433e-918b-2b2ef158fb94', '已付款', 22, 'LINE PAY', 3960, '宅配', '肖揚', '0977563324', '臺中市407西屯區台灣大道三段300號', '已完成', '2023-10-15 14:03:15'),
('c7d0fedf-ed6d-43d5-b01c-0952abfadce0', '已付款', 36, 'LINE PAY', 640, '宅配', '張凌赫', '0972051835', '台北市106大安區信義路四段26號', '已完成', '2023-10-18 09:48:36'),
('ce2c6b43-9ce8-4ab3-acab-902cba584045', '已付款', 22, 'LINE PAY', 1000, '宅配', 'ghjghu', '0975845574', '新北市220板橋區尊賢街218巷23弄10號4樓', '備貨中', '2023-10-19 10:29:19'),
('e9a4c5eb-3b74-4b71-b8b2-c86dae923229', '已付款', 36, 'LINE PAY', 1020, '宅配', '肖揚', '0955643432', '台北市106大安區信義路四段103號2F', '備貨中', '2023-10-16 17:05:40');

-- --------------------------------------------------------

--
-- 資料表結構 `post`
--

CREATE TABLE `post` (
  `post_id` int(11) NOT NULL,
  `post_title` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `post_content` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `post_restaurant_id` int(11) NOT NULL,
  `createTime` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `user_id` int(11) NOT NULL,
  `editingTime` timestamp NULL DEFAULT NULL,
  `postisValid` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post`
--

INSERT INTO `post` (`post_id`, `post_title`, `post_content`, `post_restaurant_id`, `createTime`, `user_id`, `editingTime`, `postisValid`) VALUES
(1, 'CP值超高的fine dining', '午間套餐 \n前菜+麵食+甜點 NT$780+10%\n\n前菜\n➀天使紅蝦/雪菜 Prawn/Mustard Greens\n蝦味很重的一道菜，蝦子處理得用叉子即可輕鬆剝殼非常棒。\n➁鮪魚/義式麵包沙拉 Tuna/Panzanella\n炙燒的鮪魚，不吃生的人請跳過，被打成泥的麵包醬吃不出麵包感很特別。\n➂布拉塔/草莓莎莎 Burrata/Strawberry\n友人說難得這裡不是用慢慢弄的乳酪，布拉塔配上草莓醬好吃。\n\n湯（需加價NT$150)\n➃羅馬蛋花湯 Stracciatella\n一個估狗了也不知道是啥的湯品，說是雞湯底加上大麥跟蛋花做出來的，我覺得可以不需要花這個錢。\n\n麵食\n➄義大利寬麵/托斯卡尼式肉醬 Tagliatelle/Tuscan Style Ragu\n牛肉與豬肉做成的肉醬頗好吃，還有牛肚塊非常特別。\n⑥青醬寬麵/季節鮮魚 Fazzoletti/Daily Fish\n鮮魚的份量很十足，不會有麵過多的感覺，然後這寬麵超級寬根本有十公分吧。\n➆麻花捲麵/烏魚子/青花筍 Casarecce/Bottarga/Broccolini\n（需加價NT$150)\n麵條很有嚼勁，微辣的調味吃起來很唰嘴。\n\n主菜 （需加價NT$600)\n➇伊比利豬/洋芋 Iberi Pork/Potato\n豬肉處理得恰到好處，軟嫩而不油膩。\n➈澳洲和羊/菊苣/開心果 Lamb Chop/Radicchio/Pistachio\n羊味有點重，怕羊的人請Pass，搭配有點苦的菊苣和開心果醬一起吃很合適，推薦給熱愛羊味的人。\n\n甜點\n➉防風草蛋糕 Parsnip Cake\n原來防風草不是草，是長得很像蘿蔔的根莖類，可能類似甜菜根，不知道是不是要壓掉菜味，我覺得蛋糕有點甜。', 1, '2023-09-23 08:00:00', 22, NULL, 1),
(2, '黑色情人節來吃韓式炸醬麵', '黑色情人節來吃炸醬麵，\n意外的好吃耶，\n連糖醋肉都愛。', 2, '2023-10-15 20:00:35', 21, NULL, 1),
(3, '好吃的高級日式料理', '打工帶我來吃大餐，\n餐不是我點的，\n帳單不是我結的，\n不知道點的是哪個套餐跟蒿罵起，\n八道菜適合食量不大的人。', 3, '2023-09-23 08:00:00', 1, NULL, 1),
(4, '基隆特色美食', '從小吃到大的美味，\n吃到老林都換成小林了（笑），\n在店裡現吃的炒牛肉麵很好吃，\n但還是覺得大哥外帶回家給我吃沙茶咖哩牛肉麵最好吃，\n經過外帶短暫時間的冷卻，\n沙茶咖哩醬汁更吸附在麵條上，\n比現場吃還更入味的感覺，\n長大才知道原來這個汕頭牛肉麵算是基隆的特產，\n真開心我從小就認識這門美味。', 4, '2023-09-23 08:00:00', 1, NULL, 1),
(5, '古巴三明治', '輸給古巴太桑心，\n來嗑個古巴三明治洩憤，\n感覺還是不是傳說中非常道地的古巴三明治，\n但當作好吃的熱壓三明治是很可以的，\n麵包外酥內軟，\n有奶油的香氣很難不好吃，\n牛肉跟起司的調味也很適中，\n薯條就是中規中矩，\n紅茶有點古早味自己調好甜度的那種我比較驚訝，\n可以給無糖紅茶的選項我會更喜歡。', 5, '2023-09-23 08:00:00', 3, NULL, 1),
(6, '好吃滷肉飯', '身為海外遊子，\n其實我每次回台灣最想吃的都是小吃啊，\n無奈小吃美食都不是適合久坐聊天的地方，\n因應我想吃滷肉飯的要求，\n朋友找到了一家有在賣滷肉飯的餐廳，\n一碗80元的滷肉飯滿足了我這個長年在外工作人的胃，\n油油亮亮的滷汁跟豬肉有滷肉飯膠質滿滿的黏牙感，\n唯一的缺點大概就是太貴了。', 6, '2023-09-23 08:00:00', 4, NULL, 1),
(7, '高雄必吃', '中秋連假下高雄來找大學同學散心，\n位在高雄鹽埕區的港園牛肉麵是這裡有名的老店，\n第一次吃到用拌的牛肉乾麵覺得很特別，\n微粗的麵條上和著醬油和豬油的滋味，\n很像小時候爸爸在家煮的豬油拌麵，\n配上幾塊滷得軟嫩入味的牛肉塊，\n好吃又懷舊，\n2021年再去高雄的時候還指定要再吃一次，\n其實我對豬腳麵也很有興趣，\n下次有機會想換點豬腳麵。', 7, '2023-09-23 08:00:00', 5, NULL, 1),
(8, '新鮮日料', '鮭魚肚很新鮮，\n厚厚的搭配醋飯一起吃超滿足，\n鮭魚卵很特別還用杯子裝，\n我倒是很直接就全倒在飯上了，\n不知道為什麼要另外用杯子裝，\n提供的嫩薑也很好吃不會辣，\n除了旁邊那個不知道是香菜還什麼東西的菜，\n全部都被我吃光光。', 8, '2023-09-23 08:00:00', 1, NULL, 1),
(9, '基隆廟口滷肉飯', '久違的基隆廟口，\n天一香的滷肉飯是我從小吃到大的美味，\n從一碗15元吃到現在25元，\n很是凍漲啊，\n飯上面淋上滿滿的滷汁，\n一定要拌勻才吃，\n不油不膩每一口都很幸福，\n肉羹湯的肉羹也是扎實的肉不用粉漿魚目混珠，\n一個飯一個羹幾乎每次來的定番！', 9, '2023-09-23 08:00:00', 4, NULL, 1),
(10, '雞湯拉麵', '明明看著Global Mall的網頁寫著雞玉錦拉麵，\n走進去發現店名變成奧特拉麵，\n應該是雞湯拉麵可是還有分醬油、鹽味跟白湯，\n我點了很豐盛的濃熟高湯叉燒味玉拉麵，\n濃濃的白湯很好喝，不會過鹹，\n叉燒很大方給了三、四片還有一整顆溏心蛋，\n配菜如蔥絲等都可以自行選擇要或不要，\n湯也可以選濃淡，麵也可以選軟硬，很有日本拉麵的感覺。\n\n①濃熟高湯叉燒味玉拉麵 NT$340', 10, '2023-09-23 08:00:00', 3, NULL, 1),
(11, '隱身在大安區的好吃牛肉麵', '昨天就查好今天要來吃牛肉麵，\n點了半筋半肉牛肉麵，\n肉超嫩很好吃，\n湯頭也不會死鹹，\n差點就要把整碗湯喝完，\n蔥給的很大方，\n不知道蔥價上揚的時候是否會變少，\n旁邊還有酸菜可以自己加，\n麵、肉、湯頭都很完美，\n只是一碗180沒辦法常吃。', 11, '2023-09-23 08:00:00', 5, NULL, 1),
(12, '鰻魚飯必吃', '好久不見的學長從澳洲回來約吃飯，\n吃什麼都好就是不要西餐，\n又要配合工作晚下班的另一位朋友，\n於是就推薦了幾家在朋友公司附近的餐廳，\n最後雀屏中選的魚心是不曉得何時在某篇文章推薦台北必吃的鰻魚飯專賣店之一，\n存在地圖上已經好久，\n剛好來踩點順便彌補我兩次撲空板前屋的遺憾。', 12, '2023-09-23 08:00:00', 22, NULL, 1),
(13, '永康街的排隊美食', '其實就是個蔥抓餅，\n不知道為什麼需要大排長龍，\n好吃歸好吃，\n時間多再排就好。', 13, '2023-09-23 08:00:00', 22, NULL, 1),
(14, '創意台菜', '不知何時台灣開始流行起黑糖珍珠奶茶，\n我心中最厲害的黑糖珍珠奶茶永遠是陳三鼎第一名，\n但永心鳳茶的也不錯喝，\n創意台菜很適合招待朋友。', 14, '2023-09-23 08:00:00', 22, NULL, 1),
(15, '素食也可以很好吃', '完全不覺得是在吃素的義大利料理，超級好吃的', 15, '2023-09-23 08:00:00', 22, NULL, 1),
(16, '政大人的共同記憶', '姊吃的不是早餐，是回憶，\n起司蛋餅加上冰豆紅永遠都不會錯。', 16, '2023-10-15 20:21:21', 3, NULL, 1),
(17, '政大美食', '私房麵不吃麵，來吃海南雞飯', 17, '2023-09-23 08:00:00', 1, NULL, 1),
(18, '道道都美味', '有點偏泰北的料理，綠咖哩、椒麻雞、松阪豬都超好吃。', 18, '2023-09-23 08:00:00', 22, NULL, 1),
(19, '來自香港的葡式蛋塔', '想吃蛋塔不知道去哪的話可以來這裡吃', 19, '2023-09-23 08:00:00', 5, NULL, 1),
(20, '好吃的脆皮蛋餅', '蛋餅加起司都超讚，\n豬扒蛋餅的肉肉超極厚實，餅皮脆，\n裡面起司生菜都超飽滿。', 20, '2023-09-23 08:00:00', 7, NULL, 1),
(21, '朋友說這是台北最好吃的滷肉飯', '滷肉飯很好吃，腿庫常常賣完，但店員可以不要那麼兇嗎', 21, '2023-09-23 08:00:00', 8, NULL, 1),
(22, '基隆特色蔥油餅', '從小吃到大的美味，只有基隆才有的特色蔥油餅。', 22, '2023-09-23 08:00:00', 22, NULL, 1),
(23, '美味的奇蹟', '來自日本的舒芙蕾鬆餅又柔又軟真的超好吃的', 23, '2023-09-23 08:00:00', 9, NULL, 1),
(24, '第一次吃客家菜館', '國外的友人回來指定想吃客家菜，意外發現一家好吃的客家菜館', 24, '2023-09-23 08:00:00', 3, NULL, 1),
(25, '不限時咖啡廳', '南洋咖哩飯很好吃但有點辣！！！', 25, '2023-09-23 08:00:00', 4, NULL, 1),
(26, '選擇多元的義大利餐廳', '公司附近的義大利餐廳\n餐廳的海鮮是從基隆港直接進貨非常新鮮\n今天點了四道\n酪梨醬辣味番茄莎莎海鮮披薩\n義式烤本島現流海魚\n烏魚子香蒜辣椒鯷魚炒白花椰\n松露奶醬烤菇燉飯\n每一道都好吃\n在南京復興附近不知道要吃什麼的話可以來試試看唷', 26, '2023-09-23 08:00:00', 22, NULL, 1),
(27, '義大利人開的道地披薩', '偶然在instagram上看到的影片，\r\n披薩看起來超好吃，\r\n實際吃起來也是好好吃，\r\n最想吃的就是芝麻葉火腿帕瑪森窯烤披薩，\r\n是薄餅皮的那種，\r\n雖然超大一片但不用擔心吃不完，\r\n只是芝麻葉跟火腿放得有點瀟灑，\r\nwhich means分配不均，\r\n吃的時候可能要稍微分一下，\r\n哈哈哈。\r\n然後其實我們是為了慶生而來，\r\n點了甜點提拉米蘇以為店家會在上面插上蠟燭送出來，\r\n沒想到最後竟然贈送我們一個熱騰騰的布朗尼，\r\n店員還一起唱生日快樂歌，\r\n超級用心的，\r\n想慶生的人推薦可以去這一家喔！！', 27, '2023-10-15 20:14:30', 22, NULL, 1),
(28, '忠孝新生站滷肉飯', '餐點都是以台灣小吃為主，\n滷肉飯、雞肉飯、排骨酥麵、滷味小菜通通都有，\n而且價格很可愛，\n在台北市也能有這麼平價的美食，真的很棒，\n點了小碗滷肉飯、油豆腐和燙青菜總共115台幣，\n有菜有肉的一餐，飽足又開心。', 28, '2023-09-23 08:00:00', 1, NULL, 1),
(29, '板前屋。不只鰻魚飯', '座落在偏僻的南港但不預約吃不到的高人氣日式燒烤鰻魚飯', 29, '2023-10-15 20:23:51', 19, NULL, 1),
(30, '意外道地的韓式料理', '來永和找朋友，\n朋友帶我去吃韓式餐廳，\n要知道韓國回來的我可是很挑惕的，\n不過餐廳比我想像中的道地，\n想吃韓餐可以來試試。', 30, '2023-09-23 08:00:00', 22, NULL, 1),
(31, '不會出錯的美式餐廳', '前主管找吃飯，\n四個人剛剛好點了店家配好的四人套餐，\n本來以為會吃不完，\n沒想到吃得乾乾淨淨，\n最後的布朗尼份量也剛剛好，\n完美的一餐。', 31, '2023-09-23 08:00:00', 19, NULL, 1),
(32, '台式連鎖泰式料理餐廳', '久久沒來吃瓦城，\n意外覺得好吃，\n只是兩個人點雙人套餐簡直是找死，\n最後沒吃完的全部打包回家當隔天便當。', 32, '2023-09-23 08:00:00', 3, NULL, 1),
(33, '平價義大利麵店', '份量很足夠，\n口味好吃，\n尤其是蒜味麵包的量，\n一般店家都2片，\n沒想到他們家居然是3片', 33, '2023-09-23 08:00:00', 1, NULL, 1),
(34, '六張犁義大利麵店', '以為是台式義大利麵店，\n但比想像中的道地，\n餐點中規中矩，\n鮭魚義大利麵的鮭魚有點碎，小失望。', 34, '2023-09-23 08:00:00', 22, NULL, 1),
(35, '感覺很受年輕人歡迎的韓式創意餐廳', '三伏天要吃蔘雞湯是我的儀式感，\n找了半天終於找到有賣蔘雞湯的店，\n意外的好吃且價格不貴，\n建議一定要事前預約。', 35, '2023-09-23 08:00:00', 5, NULL, 1),
(36, '台北長青義大利麵店', '久聞大名但卻是第一次拜訪，\n感覺已經開了十幾年的義大利麵店，\n餐點都是單點但卻有送一份甜點，\n甜點也不馬乎，\n算是CP值高的評價義大利麵店了。', 36, '2023-09-23 08:00:00', 22, NULL, 1),
(37, '網美義大利餐廳', '供應自製義大利麵餐點的時髦餐廳，\n天花板採挑高設計且裝潢十分現代化。\n餐點跟餐廳一樣好吃又好拍。', 37, '2023-09-23 08:00:00', 22, NULL, 1),
(38, '超佛心大份量義大利麵', '加量不加價，感覺非常適合大食量的男生來食用', 38, '2023-09-23 08:00:00', 4, NULL, 1),
(39, '信義吳興街越南料理', '找房之旅變成地方美食探索之旅，\n看房子時的晚餐，是道地的越南料理，\n青木瓜沙拉裡還有醃過的豬頭皮還是豬耳朵的東西很特別，\n份量大到吃不完必須打包回家', 39, '2023-09-23 08:00:00', 6, NULL, 1),
(40, '新網美港點店', '裝潢典雅的高級餐廳，供應創意中式料理。', 40, '2023-09-23 08:00:00', 1, NULL, 1),
(41, '超人氣重慶手工酸辣粉', '中山站巷內美食，排隊的人潮超多，喜歡川味口味的人可以去試試。', 41, '2023-09-23 08:00:00', 1, NULL, 1),
(42, '雞湯必喝', '搬家後的雞窩菜單有些小轉型，一個人也可以來享受好喝的雞湯', 42, '2023-09-23 08:00:00', 22, NULL, 1),
(43, '低調而不低價的義式餐廳', '生日來吃大餐，湯品、前菜、主餐、義大利麵和燉飯都好好吃', 43, '2023-09-23 08:00:00', 22, NULL, 1),
(44, '回政大必吃', '畢業多年還是可以為了吃這個早餐早起回政大\n起司蛋餅加冰豆紅就是讚啦', 16, '2023-09-23 08:00:00', 1, NULL, 1),
(45, '網紅推薦火鍋雖然不知道在紅什麼', '晚餐不知道要吃什麼，\n朋友選了附近的火鍋店，\n低消310起不算便宜，肉質還算新鮮，\n但醬料第二份還要加價，\n簡直是我這個醬料人的剋星。', 44, '2023-10-15 08:00:00', 1, NULL, 1),
(57, '好好吃', '好好吃', 45, '2023-10-19 02:09:00', 22, '2023-10-19 02:09:00', 1),
(58, '好好吃', '好好吃', 45, '2023-10-19 02:09:05', 22, '2023-10-19 02:09:05', 1),
(59, '好好吃', '好好吃', 45, '2023-10-19 02:09:06', 22, '2023-10-19 02:09:06', 1),
(60, '好好吃', '好好吃', 45, '2023-10-19 02:09:06', 22, '2023-10-19 02:09:06', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `post_comment`
--

CREATE TABLE `post_comment` (
  `post_comment_id` int(11) NOT NULL,
  `content` text NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `post_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post_comment`
--

INSERT INTO `post_comment` (`post_comment_id`, `content`, `create_time`, `post_id`, `user_id`) VALUES
(1, '感謝分享', '2023-10-13 03:21:18', 43, 1),
(2, '讚耶，謝謝', '2023-10-13 03:21:18', 43, 14),
(3, '看起來很好吃', '2023-10-13 03:21:18', 43, 3),
(4, '有機會想去吃看看', '2023-10-14 01:55:28', 43, 4),
(8, '古早味的蛋餅超好吃的！！', '2023-10-14 21:29:45', 44, 22),
(12, '看起來好好吃喔', '2023-10-15 18:41:58', 12, 22),
(13, '天啊看起來好好吃喔', '2023-10-15 18:45:38', 2, 22),
(14, '讚喔', '2023-10-16 04:00:34', 37, 1),
(15, '讚喔', '2023-10-16 04:00:37', 37, 1),
(17, '請問價位大概多少', '2023-10-16 17:33:43', 40, 22),
(18, '看起來很好吃噎', '2023-10-16 17:36:19', 6, 22),
(19, '好特別喔', '2023-10-16 18:37:16', 39, 22),
(22, '炸雞看起來很不錯噎', '2023-10-16 23:11:43', 35, 22),
(23, '好吃嗎?', '2023-10-19 02:07:45', 38, 22),
(24, '👍👍👍', '2023-10-21 10:17:47', 1, 21),
(25, '😍😍😍', '2023-10-21 10:19:19', 1, 19),
(26, '這家超級推!!😊', '2023-10-21 10:27:01', 1, 16),
(27, '想吃~~~> <', '2023-10-21 10:28:24', 10, 16),
(28, '這篇必須收藏❤️❤️', '2023-10-21 10:29:41', 1, 11),
(29, '本來想去吃，看到這篇決定訂別家😢', '2023-10-21 10:35:04', 34, 11),
(30, '感謝分享😊', '2023-10-21 10:36:08', 36, 11),
(31, '學生時期的回憶', '2023-10-21 10:39:52', 44, 11),
(32, '這家好吃', '2023-10-21 10:42:23', 2, 8),
(33, '😍😍😍', '2023-10-21 10:43:23', 41, 8),
(34, '瓦城久久吃一次也還可以', '2023-10-21 10:44:21', 32, 8),
(35, '😍😍😍', '2023-10-21 10:47:04', 15, 8),
(36, '店裡的氣氛很不錯👍 服務態度也很好👍很貼心服務', '2023-10-21 10:48:35', 1, 8),
(37, '好吃但吃不飽', '2023-10-21 10:50:09', 3, 9),
(38, 'CP值不高 但食材 肉品 很讚 湯頭也不錯 這樣價位算合理啦', '2023-10-21 10:51:23', 45, 9),
(39, '午餐來吃 Cp值高 每道菜都滿意', '2023-10-21 10:52:43', 43, 9),
(40, '加大不用加錢，超適合食量大的來吃', '2023-10-21 10:53:33', 38, 9),
(41, '生魚片都很大很厚~珠寶盒種類很多底下也有鋪薄薄一層米飯吃得很飽 CP值還不錯', '2023-10-21 10:56:47', 8, 9);

-- --------------------------------------------------------

--
-- 資料表結構 `post_favorite`
--

CREATE TABLE `post_favorite` (
  `post_favorite_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post_favorite`
--

INSERT INTO `post_favorite` (`post_favorite_id`, `user_id`, `post_id`) VALUES
(3, 1, 1),
(4, 1, 15),
(5, 1, 26),
(6, 1, 27),
(7, 1, 34),
(8, 1, 36),
(9, 1, 37),
(10, 1, 38),
(11, 1, 43),
(12, 1, 1),
(16, 1, 12),
(17, 17, 15),
(18, 1, 26),
(19, 1, 27),
(20, 22, 29),
(21, 1, 34),
(22, 1, 36),
(23, 21, 37),
(25, 1, 43),
(26, 3, 41),
(27, 3, 4),
(28, 3, 6),
(29, 3, 7),
(30, 3, 9),
(31, 3, 11),
(32, 3, 13),
(33, 3, 14),
(34, 3, 16),
(35, 3, 20),
(36, 3, 21),
(37, 3, 22),
(38, 3, 24),
(39, 3, 28),
(40, 3, 42),
(41, 3, 44),
(62, 1, 24),
(63, 2, 45),
(65, 2, 1),
(67, 11, 1),
(68, 11, 2),
(69, 11, 3),
(70, 22, 35),
(71, 22, 39);

-- --------------------------------------------------------

--
-- 資料表結構 `post_food_tag`
--

CREATE TABLE `post_food_tag` (
  `post_food_tag_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `food_tag_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post_food_tag`
--

INSERT INTO `post_food_tag` (`post_food_tag_id`, `post_id`, `food_tag_id`) VALUES
(1, 1, 7),
(2, 1, 26),
(3, 1, 28),
(4, 2, 4),
(5, 2, 26),
(6, 2, 28),
(7, 3, 3),
(8, 3, 26),
(9, 3, 28),
(10, 4, 1),
(11, 4, 26),
(12, 4, 28),
(13, 5, 9),
(14, 5, 26),
(15, 5, 28),
(16, 6, 1),
(17, 6, 26),
(18, 6, 28),
(19, 7, 1),
(20, 7, 26),
(21, 7, 28),
(22, 8, 3),
(23, 8, 26),
(24, 8, 28),
(25, 9, 1),
(26, 9, 26),
(27, 9, 28),
(28, 10, 3),
(29, 10, 26),
(30, 10, 28),
(31, 11, 1),
(32, 11, 26),
(33, 11, 28),
(34, 12, 3),
(35, 12, 26),
(36, 12, 28),
(37, 13, 1),
(38, 13, 22),
(39, 14, 1),
(40, 14, 26),
(41, 14, 28),
(42, 15, 7),
(43, 15, 16),
(44, 15, 26),
(45, 15, 28),
(46, 16, 1),
(47, 16, 24),
(48, 17, 26),
(49, 17, 28),
(50, 18, 10),
(51, 18, 26),
(52, 18, 28),
(53, 19, 5),
(54, 19, 19),
(55, 20, 1),
(56, 20, 24),
(57, 21, 1),
(58, 21, 26),
(59, 21, 28),
(60, 22, 1),
(61, 22, 24),
(62, 23, 23),
(63, 23, 19),
(64, 23, 27),
(65, 24, 1),
(66, 24, 28),
(67, 25, 19),
(68, 25, 26),
(69, 26, 7),
(70, 26, 26),
(71, 26, 28),
(72, 27, 7),
(73, 27, 26),
(74, 27, 28),
(75, 28, 1),
(76, 28, 26),
(77, 28, 28),
(78, 29, 3),
(79, 29, 28),
(80, 29, 13),
(81, 30, 4),
(82, 30, 26),
(83, 30, 28),
(84, 31, 6),
(85, 31, 26),
(86, 31, 28),
(87, 32, 10),
(88, 32, 26),
(89, 32, 28),
(90, 33, 7),
(91, 33, 26),
(92, 33, 28),
(93, 34, 7),
(94, 34, 26),
(95, 34, 28),
(96, 35, 4),
(97, 35, 18),
(98, 35, 28),
(99, 36, 7),
(100, 36, 26),
(101, 36, 28),
(102, 37, 7),
(103, 37, 26),
(104, 37, 28),
(105, 38, 7),
(106, 38, 26),
(107, 38, 28),
(108, 39, 11),
(109, 39, 26),
(110, 39, 28),
(111, 40, 5),
(112, 40, 26),
(113, 40, 28),
(114, 41, 2),
(115, 41, 26),
(116, 41, 28),
(117, 42, 1),
(118, 42, 26),
(119, 42, 28),
(120, 43, 7),
(121, 43, 26),
(122, 43, 28),
(123, 44, 1),
(124, 44, 24),
(125, 45, 1),
(126, 45, 12),
(127, 45, 28),
(128, 46, 2),
(129, 46, 26),
(130, 46, 28),
(131, 49, 3),
(132, 50, 6),
(133, 51, 2),
(134, 52, 1),
(135, 52, 3),
(136, 53, 1),
(137, 55, 1),
(138, 55, 28),
(139, 55, 26),
(140, 56, 2),
(141, 56, 26),
(142, 56, 1),
(143, 57, 3),
(144, 57, 8),
(145, 57, 6),
(146, 58, 3),
(147, 58, 6),
(148, 58, 8),
(149, 59, 3),
(150, 59, 6),
(151, 59, 8),
(152, 60, 6),
(153, 60, 3),
(154, 60, 8);

-- --------------------------------------------------------

--
-- 資料表結構 `post_image`
--

CREATE TABLE `post_image` (
  `post_image_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `post_image_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post_image`
--

INSERT INTO `post_image` (`post_image_id`, `post_id`, `post_image_name`) VALUES
(1, 1, '1690459201.jpg'),
(2, 1, '1690459202.jpg'),
(3, 1, '1690459203.jpg'),
(4, 1, '1690459204.jpg'),
(5, 1, '1690459205.jpg'),
(6, 1, '1690459206.jpg'),
(7, 1, '1690459207.jpg'),
(8, 1, '1690459208.jpg'),
(9, 1, '1690459209.jpg'),
(10, 1, '1690459210.jpg'),
(11, 2, '1690459211.jpg'),
(12, 2, '1690459212.jpg'),
(13, 3, '1690459213.jpg'),
(14, 3, '1690459214.jpg'),
(15, 3, '1690459215.jpg'),
(16, 3, '1690459216.jpg'),
(17, 3, '1690459217.jpg'),
(18, 3, '1690459218.jpg'),
(19, 3, '1690459219.jpg'),
(20, 3, '1690459220.jpg'),
(21, 4, '1690459221.jpg'),
(22, 5, '1690459222.jpg'),
(23, 6, '2022-09-28.jpeg'),
(24, 7, 'IMG_2390.JPG'),
(25, 8, 'IMG_3097.JPG'),
(26, 8, 'IMG_3096.JPG'),
(27, 9, 'IMG_3188.JPG'),
(28, 10, 'IMG_3203.JPG'),
(29, 11, 'IMG_3283.JPG'),
(30, 12, 'IMG_3306.jpg'),
(31, 12, 'IMG_3307.jpg'),
(32, 12, 'IMG_3308.jpg'),
(33, 12, 'IMG_3309.jpg'),
(34, 13, 'IMG_0179.jpg'),
(35, 14, 'IMG_0192.JPG'),
(36, 14, 'IMG_0193.JPG'),
(37, 14, 'IMG_0194.JPG'),
(38, 15, 'IMG_0202.jpg'),
(39, 15, 'IMG_0203.jpg'),
(40, 16, 'IMG_2920.JPG'),
(41, 17, 'IMG_0210.JPG'),
(42, 18, 'IMG_0212.JPG'),
(43, 18, 'IMG_0213.JPG'),
(44, 18, 'IMG_0214.JPG'),
(45, 19, 'IMG_0237.JPG'),
(46, 20, 'IMG_0262.jpg'),
(47, 21, 'IMG_3991.JPG'),
(48, 22, 'IMG_4210.JPG'),
(49, 23, 'IMG_4001.JPG'),
(50, 23, 'IMG_4002.JPG'),
(51, 24, 'IMG_6695.JPG'),
(52, 24, 'IMG_6699.JPG'),
(53, 24, 'IMG_6700.JPG'),
(54, 24, 'IMG_6701.JPG'),
(55, 24, 'IMG_6702.JPG'),
(56, 24, 'IMG_6703.JPG'),
(57, 24, 'IMG_6704.JPG'),
(58, 24, 'IMG_6705.JPG'),
(59, 24, 'IMG_6707.JPG'),
(60, 24, 'IMG_6709.JPG'),
(61, 25, 'IMG_3515.JPG'),
(62, 26, 'cincin1.jpg'),
(63, 26, 'cincin2.jpg'),
(64, 26, 'cincin3.jpg'),
(65, 26, 'cincin4.jpg'),
(66, 27, 'IMG_4866.JPG'),
(67, 27, 'IMG_4869.JPG'),
(68, 27, 'IMG_4872.JPG'),
(70, 27, 'IMG_4874.JPG'),
(71, 27, 'IMG_4875.JPG'),
(72, 27, 'IMG_4878.JPG'),
(73, 27, 'IMG_4880.JPG'),
(74, 28, 'IMG_4850.JPG'),
(75, 29, 'IMG_4774.JPG'),
(76, 29, 'IMG_4776.JPG'),
(77, 29, 'IMG_4779.JPG'),
(78, 29, 'IMG_4780.JPG'),
(79, 29, 'IMG_4781.JPG'),
(80, 29, 'IMG_4782.JPG'),
(81, 29, 'IMG_4783.JPG'),
(82, 30, 'IMG_4757.JPG'),
(83, 30, 'IMG_4758.JPG'),
(84, 31, 'IMG_4698.JPG'),
(85, 31, 'IMG_4700.JPG'),
(86, 31, 'IMG_4701.JPG'),
(87, 31, 'IMG_4702.JPG'),
(88, 31, 'IMG_4703.JPG'),
(89, 31, 'IMG_4704.JPG'),
(90, 32, 'IMG_4643.JPG'),
(91, 32, 'IMG_4644.JPG'),
(92, 32, 'IMG_4648.JPG'),
(93, 32, 'IMG_4649.JPG'),
(94, 32, 'IMG_4650.JPG'),
(95, 32, 'IMG_4651.JPG'),
(96, 33, 'IMG_4622.JPG'),
(97, 33, 'IMG_4624.JPG'),
(98, 33, 'IMG_4625.JPG'),
(99, 34, 'IMG_4602.JPG'),
(100, 35, 'IMG_4442.JPG'),
(101, 35, 'IMG_4444.JPG'),
(102, 35, 'IMG_4445.JPG'),
(103, 35, 'IMG_4448.JPG'),
(104, 36, 'IMG_4337.JPG'),
(105, 36, 'IMG_4338.JPG'),
(106, 37, 'IMG_4304.JPG'),
(107, 37, 'IMG_4306.JPG'),
(108, 37, 'IMG_4308.JPG'),
(109, 37, 'IMG_4310.JPG'),
(110, 37, 'IMG_4312.JPG'),
(111, 37, 'IMG_4314.JPG'),
(112, 38, 'IMG_4283.JPG'),
(113, 39, 'IMG_3764.JPG'),
(114, 39, 'IMG_3765.JPG'),
(115, 40, 'IMG_3413.JPG'),
(116, 40, 'IMG_3415.JPG'),
(117, 40, 'IMG_3417.JPG'),
(118, 40, 'IMG_3421.JPG'),
(119, 40, 'IMG_3424.JPG'),
(120, 40, 'IMG_3426.JPG'),
(121, 40, 'IMG_3427.JPG'),
(122, 40, 'IMG_3433.JPG'),
(123, 40, 'IMG_3437.JPG'),
(124, 41, 'IMG_3387.JPG'),
(125, 41, 'IMG_3388.JPG'),
(126, 41, 'IMG_3389.JPG'),
(127, 42, 'IMG_3364.jpg'),
(128, 42, 'IMG_3365.jpg'),
(129, 42, 'IMG_3366.jpg'),
(130, 42, 'IMG_3367.jpg'),
(131, 43, 'sabatini1.jpg'),
(132, 43, 'sabatini2.jpg'),
(133, 43, 'sabatini3.jpg'),
(134, 43, 'sabatini4.jpg'),
(135, 43, 'sabatini5.jpg'),
(136, 43, 'sabatini6.jpg'),
(137, 43, 'sabatini7.jpg'),
(138, 43, 'sabatini8.jpg'),
(139, 44, 'IMG_0208.jpg'),
(140, 45, 'IMG_3116.JPG'),
(141, 45, 'IMG_3117.JPG'),
(142, 45, 'IMG_3118.JPG'),
(143, 46, 'IMG_6841.JPG'),
(144, 46, 'IMG_6842.JPG'),
(145, 46, 'IMG_6844.JPG'),
(146, 46, 'IMG_6846.JPG'),
(147, 46, 'IMG_6847.JPG');

-- --------------------------------------------------------

--
-- 資料表結構 `post_restaurant`
--

CREATE TABLE `post_restaurant` (
  `post_restaurant_id` int(11) NOT NULL,
  `restaurant_city` varchar(10) NOT NULL,
  `restaurant_district` varchar(10) NOT NULL,
  `restaurant_address` varchar(50) NOT NULL,
  `restaurant_name` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `post_restaurant`
--

INSERT INTO `post_restaurant` (`post_restaurant_id`, `restaurant_city`, `restaurant_district`, `restaurant_address`, `restaurant_name`) VALUES
(1, '台北市', '大安區', '安和路一段116號', 'CROM Taipei'),
(2, '台北市', '松山區', '八德路三段209號', '韓華園'),
(3, '台北市', '信義區', '松智路1號', '三井Cusine M'),
(4, '基隆市', '中山區', '復旦路9號', '老林沙茶汕頭牛肉店'),
(5, '台北市', '信義區', '忠孝東路五段71巷3弄32號1樓', '福嗑 Luckyeat'),
(6, '台北市', '中山區', '松江路100巷9-1號', 'My灶'),
(7, '高雄市', '鹽埕區', '大成街55號', '港園牛肉麵'),
(8, '台北市', '信義區', '和平東路三段171號', 'THE・春'),
(9, '基隆市', '仁愛區', '仁三路27-1號', '天一香肉羹順'),
(10, '台北市', '南港區', '忠孝東路七段371號B1', '奧特拉麵'),
(11, '台北市', '大安區', '信義路四段30巷2-1號', '光復牛肉麵'),
(12, '台北市', '中山區', '吉林路47號', '魚心日本料理'),
(13, '台北市', '大安區', '永康街6巷1號', '天津蔥抓餅'),
(14, '台北市', '信義區', '忠孝東路五段68號3樓', '永心鳳茶'),
(15, '台北市', '信義區', '松壽路11號2樓', 'MIACUCINA'),
(16, '台北市', '文山區', '萬壽路14號', '古早味蛋餅飯糰'),
(17, '台北市', '文山區', '指南路二段2號', '私房麵'),
(18, '台北市', '信義區', '忠孝東路五段68號4樓', '泰集 Thai Bazaar'),
(19, '台北市', '中山區', '南京西路12號B1', '檀島香港茶餐廳'),
(20, '台北市', '中山區', '龍江路21巷3號', '味鼎'),
(21, '台北市', '中山區', '南京東路二段115巷20號', '富霸王豬腳'),
(22, '基隆市', '中正區', '信二路309號', '周家豆漿店'),
(23, '台北市', '中山區', '南京西路14號誠品南西店3F', 'FLIPPER\'S 奇蹟的舒芙蕾鬆餅 誠品南西店'),
(24, '台北市', '中正區', '晉江街1號', '晉江茶堂'),
(25, '台北市', '大安區', '信義路四段30巷48號', '杯盃咖啡廳'),
(26, '台北市', '松山區', '慶城街16巷16號1F', 'Cin Cin Osteria請請義大利餐廳 (慶城店)'),
(27, '台北市', '大安區', '光復南路260巷5號', 'Osteria Rialto 雅朵義大利餐館'),
(28, '台北市', '中正區', '新生南路一段14號', '金湘台灣小吃'),
(29, '台北市', '南港區', '研究院路一段88號', '板前屋炭烤鰻魚飯'),
(30, '新北市', '永和區', '信義路75-1號', '高麗亭'),
(31, '台北市', '信義區', '松壽路11號2樓', '吉比鮮釀餐廳 - 信義店'),
(32, '新北市', '永和區', '永和路二段116號', '瓦城泰國料理 - 永和店'),
(33, '新北市', '永和區', '復興街16巷18號', '愛沐義麵屋-頂溪店'),
(34, '台北市', '大安區', '安居街16號1樓', '義家人'),
(35, '台北市', '中山區', '松江路40號1樓', 'Broccoli beer韓國餐酒食堂'),
(36, '台北市', '中山區', '南京西路12巷13弄9號', '蘿絲瑪莉義麵坊'),
(37, '台北市', '大安區', '光復南路290巷32號', 'PASTAIO 手工義大利麵 光復店'),
(38, '台北市', '大安區', '大安路一段232號一樓', '光司DATE'),
(39, '台北市', '信義區', '吳興街140號', '依鼎越式美食'),
(40, '台北市', '中山區', '伊通街39號', '玖尹-新派中式餐酒館'),
(41, '台北市', '大同區', '南京西路18巷6弄8之1號', '川渝小吃坊'),
(42, '台北市', '信義區', '和平東路三段377號', '雞窩餐廳'),
(43, '台北市', '中山區', '長安東路二段84號1樓', 'SABATINI CUCINA 深庭義式餐廳'),
(44, '台北市', '中山區', '伊通街42號', '有田屋火鍋'),
(45, '基隆市', '中正區', '義一路58號', '小峨嵋川菜館');

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(300) NOT NULL,
  `price` int(11) NOT NULL,
  `product_description` varchar(10000) NOT NULL,
  `specification` mediumtext NOT NULL,
  `product_type_id` int(11) NOT NULL,
  `product_type_list_id` int(11) NOT NULL,
  `items` varchar(300) DEFAULT NULL,
  `createTime` datetime NOT NULL DEFAULT current_timestamp(),
  `isValid` int(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`product_id`, `product_name`, `price`, `product_description`, `specification`, `product_type_id`, `product_type_list_id`, `items`, `createTime`, `isValid`) VALUES
(27, '圓可頌禮盒', 550, '七入禮盒包含七種口味 : 香草可頌卷、野莓可頌卷、抹茶可頌卷、巧克力可頌卷、芒果可頌卷、鹹蛋黃可頌卷、柚子可頌卷。\\n可頌卷外皮極為酥脆，內層千層柔軟口感，搭配滿滿的內餡餡料，每一口入口輕脆又爆漿!', '商品產地 : 台灣\\n賞味期限 : 收到商品後 5 天\\n內容量 : 735g x 1', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(28, '脆皮檸檬磅蛋糕 單條禮盒', 290, '入鮮榨檸檬汁製作，創造清爽酸甜口感，外層脆皮糖霜有別於傳統製作，加入黃金比例蛋白，更脆更讓人無法自拔，並包覆整個蛋糕體，讓你每一口都吃得到脆皮糖霜，再搭配蛋糕體的扎實濕潤感，讓整體美味程度達到完美境界！', '商品產地 : 台灣\\n賞味期限 : 商品開封後 7 天\\n內容量 : 280g x 1', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(29, '經典原味可麗露', 500, '外酥內軟的口感，冰冰涼涼吃像冰淇淋一樣好吃！夏天最適合~', '商品產地 : 台灣\\n賞味期限 : 商品開封後 10 天\\n內容量 : 40g x 6', 2, 6, NULL, '2023-10-06 09:57:00', 1),
(30, '爆漿太妃糖心軟軟小乳酪蛋糕禮盒/四入', 400, '香甜焦糖太妃糖新滋味!內餡搭配清爽酸香的北海道四葉乳酪，讓微苦甜的焦糖海鹽增加清新風味，內餡心軟軟，融化你的心 !', '商品產地 : 台灣\\n賞味期限 : 收到商品後 14 天 天\\n內容量 : 55g x 4', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(31, '荔枝葡萄乳酪塔', 1080, '荔枝加上葡萄！口感清新、微酸不甜膩，是春日的蛋糕首選！ 春日輕甜新上市！帶給你前所未有的清新感受！', '商品產地 : 台灣\\n賞味期限 : 製造日期後 10 天\\n內容量 : 700g x 1', 2, 6, NULL, '2023-10-06 09:54:20', 1),
(32, '派對組合乳酪蛋糕 - 四種口味', 1180, '優選四款經典乳酪蛋糕經典原味、丸久小山園抹茶生巧、仲夏莓果以及Cacao Barry生巧，四種特色風味一次擁有，好東西要和好朋友分享，美食更不能自己獨享。 【榮獲亞太無添加協會最高三星認證】! 我們的乳酪蛋糕使用１００％北海道乳酪，希望您以最佳風味品嘗！商品一律貼心為您切成八塊囉！以方便您退冰食用！若不需要此服務請備註留言給我們喔!', '商品產地 : 台灣\\n賞味期限 :製造日期後 14 天\\n內容量 : 100g x 8', 2, 6, '無添加,', '2023-10-06 09:51:25', 1),
(33, '在櫻花季的阿里山沏一壺茶雪糕捲', 580, '「鐵觀音」醇厚，特有的弱果酸香氣，搭上莓果碎片，宛如櫻花飄落；增加視覺和口感的層次，賞櫻之旅將開始！ 獨創山形內餡，嚴選天然風味食材。 耗費三日純手工製作，希望留下無盡的回憶！ 雪糕般絲滑順口的內餡，以及豐富的口味選擇。 香甜滋味在口中綻放，帶來綿密細膩的饗宴！', '商品產地 : 台灣\\n賞味期限 : 製造日期後 7 天\\n內容量 : 500g x 1', 2, 6, NULL, '2023-10-06 09:56:59', 1),
(34, '爆漿心軟軟小乳酪蛋糕禮盒/四入', 320, '心軟軟小乳酪禮盒 乳酪控最愛?享受冰冰涼涼冰心感 一盒四入 入口即化。每一刻都是心軟軟的瞬間??', '商品產地 : 台灣\\n賞味期限 : 收到商品後 14 天\\n內容量 : 55g x 4', 2, 6, NULL, '2023-10-06 09:56:25', 1),
(35, 'MANO 義式手工馬卡龍禮盒 | 12入', 840, '再也不選擇障礙 經典覆盆子/萊姆黃檸檬/清爽柚子/開心果/東方美人/藍伯爵/焦糖海鹽/玫瑰荔枝/醇香紅烏龍/黑醋栗薰衣草/提拉米蘇/百香果，十二種口味一次滿足 !', '商品產地 : 台灣\\n賞味期限 : 收到商品後 14 天\\n內容量 : 600g x 1', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(36, '【LS手作甜點】藍帶主廚評比得獎蛋糕(6吋)', 980, '2020蘋果日報母親節蛋糕評比第一名 堅持採用整顆新鮮蘋果，不使用現成果泥，與蘭姆酒交織成熟風味！甜中帶酸，飄香餘韻，停不下口的好滋味！ 當前奏的蘋果酸味響起，核桃跟著鏗鏘有力的出現，焦糖和聲，運用Flambe技術，在鍋中點火將酒精燒掉，不', '商品產地 : 台灣 \\n 賞味期限 : 製造日期後 30 天 \\n 內容量 : 700g x 1', 2, 6, NULL, '2023-10-06 09:51:25', 1),
(37, '【久久津】12E-2玉兔菠蘿九九禮盒', 680, '-玉兔燒\r\n外皮選用牛奶桃山皮，淡淡奶香口感綿密細緻，內餡搭配茶香濃厚的伯爵茶豆沙餡，與香醇的海鹽太妃流心醬巧妙融合，讓最清新可愛的玉兔帶給您滿滿的好運\r\n-九九金燒\r\n內餡含有濃郁的切達起司，加上Q彈滑順的麻糬，鹹甜融合令人回味無窮，好吃又賞心悅目\r\n-菠蘿蛋黃酥\r\n菠蘿造型的香酥餅皮，有別以往的傳統蛋黃酥，外皮口感彷彿港式桃酥的酥脆滋味，特別挑選100%降低甜度的紅豆餡，搭配特製工法的鹹蛋黃，酥脆柔軟雙重奏，絕對超越您所吃過的蛋黃酥呦', '商品產地 : 台灣\\n賞味期限 : 常溫保存45天\\n內容量 : 10入/盒', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(38, '焦糖布丁六吋塔', 650, '進口奶油和優質麵粉，經過精心烘焙，使表面金黃酥脆，內層則保持柔軟\n再酥脆塔皮和滑順的焦糖布丁，帶來了雙重口感的感受。', '商品產地 : 台灣\\n賞味期限 : 商品開封後 7 天\\n內容量 : 350g x 1', 2, 6, NULL, '2023-10-06 09:55:00', 1),
(39, '純素藍莓乳酪蛋糕', 900, '我們選擇製作藍莓口味的蛋糕，不僅僅因為它們美味，也因為它們的營養價值，藍莓為超級食物的一種，富含抗氧化劑、維生素和礦物質。\n我們使用自製的無麩質楓糖餅乾底，提供美味的基礎。接下來是腰果乳酪，口感滑順而豐富。最後，我們在頂部加上一層由整顆藍莓製成的美味藍莓醬。\n與一般乳酪蛋糕的厚重油膩感不同，擁有一口接一口的清爽風味，更富含優良的油脂及營養。', '商品產地 : 台灣\\n賞味期限 : 收到商品後 14 天\\n內容量 : 610g x 1', 2, 6, '蛋奶素,送禮,無麩質', '2023-10-06 09:51:25', 1),
(40, '【伊莎貝爾X來貘聯名款】來貘布雪綜合禮盒', 398, '香伊莎貝爾X國際插畫家Cherng攜手推出聯名新品禮盒『來貘布雪禮盒』，讓伴手禮盒增添活潑清新風格。嚴選高人氣經典招牌布雪，鬆軟必嚐的甜蜜組合，輕鬆入手、送禮、自用兩相宜。', '商品產地 : 台灣\\n賞味期限 : 敬請儘早使用\\n內容量 : 10包/盒', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(41, '杜樂麗花園 法式綜合塔 9入', 639, '【杜樂麗花園】法式綜合塔禮盒（9入）巴黎絕美杜樂麗花園，難以言喻的法式之美!\n獨門特製靈魂餅皮，單吃也很過癮!', '商品產地 : 台灣\\n賞味期限 : 製造日期後 14 天\\n內容量 : 35g x 9', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(42, '抹茶紅豆椪(茶香日式麻糬口味 ) 6入盒', 405, '濃郁茶香、嚴選紅豆餡、Ｑ彈麻糬添加、甜而不膩、餅皮層次酥鬆綿密', '商品產地 : 台灣\\n賞味期限 :製造日期後 30 天\\n內容量 : 75g x 6', 2, 6, NULL, '2023-10-06 09:51:25', 1),
(43, '【香港皇玥】流心雙輝月餅禮盒', 680, '由葉永華大師傅(奶黃月餅創始人)親自監製，解決月餅皮餡分離難題，做到月餅皮餡緊密結合，完全不會分離，品嚐口感更加完滿。\n流心奶黃月餅精選天然牛油與頂級鹹蛋黃秘製餡料，月餅由內而外散發濃郁奶黃及鹹蛋黃香味，奶黃流心如絲般柔滑。\n流心芝麻月餅嚴選顆粒飽滿的上品黑芝麻，經多重工序秘製成流心芝麻餡，芝麻香氣濃郁。', '商品產地 : 香港\\n賞味期限 : 製造日期後 45 天\\n內容量 : 45g x 8', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(44, '【香港美心】精選口味月餅-限量版', 750, '精選口味月餅限量版 精挑細選的六款口味，細意心思，精彩獻禮 典藏禮盒設計包裝，送禮尊貴大方。', '商品產地 : 香港\\n賞味期限 : 製造日期後 120 天\\n內容量 : 730g x 1', 2, 6, '送禮,', '2023-10-06 09:51:25', 1),
(45, '芋頭鹹蛋黃巴斯克 6吋 甜點禮盒', 880, '最濃郁！可以吃到芋頭塊的芋頭蛋糕 人氣巴斯克蛋糕迷人焦香 除了香濃芋泥 加入大量『鹹蛋黃』甜鹹甜鹹古早滋味 在蛋糕表面以及蛋糕體中用了大量的蒸煮芋頭及鹹蛋黃 每一口都扎扎實實不馬虎', '商品產地 : 台灣\\n賞味期限 : 製造日期後 14 天\\n內容量 : 1000g x 1', 2, 6, NULL, '2023-10-06 09:51:25', 1),
(46, 'Simple Kaffa 興波咖啡 世界冠軍濾掛式咖啡 30 包', 1250, '世界盃咖啡大師冠軍吳則霖嚴選製作 時時刻刻享受世界冠軍的咖啡 知名旅遊網站「Big 7 Travel」評鑑2019世界第一的咖啡廳 氮氣填充保鮮 堅持台灣現烘製作', '商品產地 : 台灣\\n賞味期限 : 製造日期後 365 天\\n內容量 : 12g x 30', 1, 2, NULL, '2023-10-06 09:51:25', 1),
(47, '【陽光果果】零添加 | 愛文芒果乾', 230, '使用台南玉井出產頂級的愛文芒果低溫乾燥，完全零添加，只有濃縮水果最純粹的美味。\n-第55屆金馬獎指定貴賓禮品 \n-榮獲A.A「亞太無添加美食」評鑒最高榮譽三星獎 \n-旅遊觀光局頒發台南好物標章 \n-國際機場熱賣免稅商品', '商品產地 : 台灣\\n賞味期限 : 製造日期後 240 天\\n內容量 : 100g x 1', 3, 13, '無添加,送禮', '2023-10-06 09:55:20', 1),
(48, '京盛宇【茶葉茶包禮盒】墨金雙享禮盒', 1150, '墨金雙享禮盒｜不知春100g+10入御守袋茶\n「Permanent Revolution Of Tea」茶的永恆進化\n在2013年京盛宇獲選為金馬獎第五十屆指定茶葉品牌，恰逢金馬影展五十週年，在這個別具歷史意義的重要時刻，精心設計了「墨金禮盒」，作為上千位貴賓的指定禮品。在設計發想的時候，希望能用最簡單的元素打造最低調的奢華，因此，在色調上延續金馬的主視覺─黑與金。然後採用黑卡加燙金的方式，並刻意突顯京盛宇「紫砂壺手沖」的核心概念，以燙金加上打凸的「紫砂壺」作為禮盒的主要視覺，並加上「Permanent Revolution Of Tea」（茶的永恆進化）的字樣，期許台灣茶在時代的交會點成功轉型，讓更多人感受台灣茶的甘甜美好。適逢京盛宇第十二週年，我們重新復刻墨金禮盒，搭配了京盛宇經典台灣茶風味-不知春以及京盛宇十入御守袋茶，選用黑卡美術紙＋燙金，凸顯質感，典雅大方，除了祝福，更要讓您感受純淨美好的台灣茶風味。', '商品產地 : 台灣\\n賞味期限 : 製造日期後 730 天\\n內容量 : 125g x 1', 1, 1, '送禮,', '2023-10-06 09:51:25', 1),
(49, '&black Blend優蛋白特調咖啡-拿咖啡-10入盒裝 (無甜味)', 549, '&black Blend 不只是美味咖啡，更是一種全新的營養體驗。每份提供20克乳清蛋白營養、6%膳食纖維及維生素B&C，讓特調咖啡不僅是一種享受，還能給身體滿滿的能量，適合早餐、餐間及運動前營養補充！拿鐵咖啡精選100%阿拉比卡原豆，搭配歐洲優質牛乳，呈現濃醇咖啡香氣及豐厚圓滑口感。', '商品產地 : 台灣\\n賞味期限 : 製造日期後 540 天\\n內容量 : 35g x 10', 1, 2, NULL, '2023-10-06 09:51:25', 1),
(50, '金匠食味廚房 飯不剩醬料 手作嚴選香辛味香濃辣椒粉', 220, '【杜樂麗花園】法式綜合塔禮盒（9入）巴黎絕美杜樂麗花園，難以言喻的法式之美!\n獨門特製靈魂餅皮，單吃也很過癮!', '商品產地 : 台灣\\n賞味期限 : 商品開封後 365 天\\n內容量 : 1g x 90', 4, 18, NULL, '2023-10-06 09:51:25', 1),
(51, 'Rise 健康伴手禮【發芽糙米佐發芽黑米】', 297, 'Project Rise 發芽穀物，現代人的理想食糧。獻給持續前進的您，更好的明天，更好的自己。\n全穀發芽，水解纖維，獲取食物完整營養，咀嚼更輕鬆。純天然、無添加化學藥劑、無防腐劑。', '商品產地 : 台灣\\n賞味期限 : 製造日期後 270 天\\n內容量 : 600g x 1', 4, 16, '無添加,送禮', '0000-00-00 00:00:00', 1),
(52, 'Zouitina ROBUST 十月早摘 - 頂級冷壓初榨橄欖油', 790, 'Zouitina Extra Virgin Olive Oil 品質保證：\n 高成本的手工採摘, 堅持使用新鮮無損壞的橄欖果\n 壓榨製程序中絕對不經過任何化學精煉加工 \n 100% 不混假油\n 每一批原裝進口的Extra Virgin 橄欖油瓶身都有清楚的『採收年份』標示\n 讓每一位朋友與家人都能安心食用它。', '商品產地 : 摩洛哥\\n賞味期限 : 商品開封後 60 天\\n內容量 : 250ml', 4, 18, NULL, '2023-10-06 09:51:25', 1),
(53, '【 Granola格蘭諾拉 】榖脆烤燕麥片優格伴侶 - 棉花糖樂園', 265, '想到遊樂園，彷彿都能聞到一股甜甜的香味 ! 啵普特製牛奶醬搭配堅果與迷你棉花糖烘烤，一口吃下！快樂回憶頓時湧上心頭~', '商品產地 : 台灣\\n賞味期限 : 收到商品後 14 天\\n內容量 : 150ml', 3, 14, NULL, '2023-10-06 09:51:25', 1),
(54, '黑巧克力愛餡蛋捲', 480, '有餡升級!! 奢華雙重巧克力、嚴選70%巧克力品牌，精緻金箔感外盒設計。琥珀紋餅皮包覆濃郁巧克力餡，吃得到豐富層次、完美比例的苦甜醇厚口感，每一口都是奢華高級享受！', '商品產地 : 台灣\\n賞味期限 : 收到商品後 45天\\n內容量 : 30g x 8', 2, 7, NULL, '2023-10-06 09:51:25', 1),
(55, '【烘焙燕麥】濃郁醇厚 / 可可蔓越莓', 250, '嚴選大燕麥及黑麥，顛覆傳統燕麥生澀口感\n蜂蜜+橄欖油低溫烘焙拌烤\n呈現食物最原始的風味及口感\n可單吃或搭配優格、牛奶、豆漿', '商品產地 : 台灣\\n賞味期限 : 製造日期後 90 天\\n內容量 : 190g x 1', 3, 14, NULL, '2023-10-06 09:54:50', 1),
(56, '【天然蔬果昔】好營養纖體組-4包入', 720, 'SMOOSY天然蔬果昔，精選口味好營養纖體4包組，由護理師配製，使用50種以上天然蔬果及超級食物搭配，每包有8-10種多元食材，重量約200克，豐富的蔬果及超級食物為您補充滿滿蛋白質、纖維質及維生素和礦物質', '商品產地 : 台灣\\n賞味期限 : 製造日期後 90 天\\n內容量 : 198g x 4', 1, 3, NULL, '2023-10-06 09:51:25', 1),
(57, '活力東勢-胡蘿蔔汁禮盒裝', 1848, ' \\n．季節嚴選，新鮮採收製成。 \n \\n．全果榨取，保留天然膳食纖維。\n \\n．保證不含防腐劑。\n \\n．保留胡蘿蔔原果甜度，不加糖份。\n \\n．榮獲 ISO22000 系統驗證通過。\n \\n．榮獲 HACCP 系統驗證通過。\n \\n．胡蘿蔔為產銷履歷之農產品。\n\\n．胡蘿蔔為外銷日本胡蘿蔔專區之農產品。\n\\n．2011年度胡蘿蔔出口日本100貨櫃全數通過日本國家安全檢查。', '商品產地 : 台灣\\n賞味期限 : \r\n商品開封後 1 天\\n內容量 : 290ml x 24', 1, 3, NULL, '2023-10-06 09:51:25', 1),
(58, 'Aoyama Decabo 巧克力美容系列禮盒/3入', 1309, '\r\nAoyama Decabo原創的低碳水化合物和濃郁巧克力用於製作不使用糖和麵粉的水果脆餅。 代替糖，我們使用不會升高血糖水平的植物性甜味（主要是赤蘚糖醇），代替麵粉，我們使用香噴噴的大豆泡芙和大量飲食', '商品產地 : 台灣 \\n賞味期限 : 製造日期後 40 天 \\n內容量 : 9g x 30', 3, 11, NULL, '2023-10-06 09:51:25', 1),
(59, '【野樂茶】茶山太極-台灣四大青茶禮盒(32入)', 3500, '1869年，台灣茶以「福爾摩沙烏龍」之名運銷美國，站上國際舞臺，揭開了台茶大時代的序幕，隨後，因世界性不景氣，這種條索式烏龍茶發生滯銷，台茶陷入危機，從而展開了製茶工藝的創新變法，歷百年摸索淬鍊，發展出四種風味獨樹一幟的青茶：以輕發酵工序做出如花凝香的包種茶、以炭火焙籠反覆團揉做出熟沈焙香與奇妙果酸滋味的鐵觀音、以小綠葉蟬農法及靜置回潤二度發酵的製程做出麝香熟果味的膨風茶、以熱團揉及焙火工序做出甘潤喉韻的烏龍茶，【野樂茶】台灣四大青茶，採摘自生趣盎然的野放式茶園，並遵循百年傳承工法製作，經製為團球狀棉布茶包，包裝紮綁形態神似打太極的人偶，故名「太極茶包」。\r\n茶葉品種：文山包種茶與凍頂烏龍茶為青心烏龍品種，北埔膨風茶為青心大冇品種，木柵正欉鐵觀音茶為鐵觀音品種。', '商品產地 : 台灣 \\n賞味期限 : 製造日期後 40 天 \\n內容量 : 9g x 30', 1, 1, NULL, '2023-10-06 09:51:25', 1),
(61, '打包包子明星組合/5入', 175, '一次想吃多種口味嗎？打包滿足您的需求！【 打包明星組合(5入) 】讓包迷們一次品嚐五種明星口味，內容包含招牌鮮肉包 x1、紅燒獅子頭包 x1、泰式打拋豬包 x1、芝麻包 x1、芋頭包 x1，一袋驚喜大大大滿足！', '商品產地 : 台灣 \\n賞味期限 : 收到商品後 90 天 \\n內容量 : 110g x 5', 4, 15, NULL, '2023-10-06 09:51:25', 1),
(62, '【HEY YUM!】丹麥無麩質水果軟糖4入', 626, '\r\n丹麥原裝進口\\n不含人工香料、色素、甜味劑、防腐劑\\n莓果蔬食口味 (藍色包裝) 為素食者可食用\\n不含麩質、不含乳糖 (優格水果口味除外)，過敏體質也不用擔心\\n巴黎潮流指標選品店Colette選用及肯定的可愛療癒系包裝\r\n', '商品產地 : 台灣 \\n賞味期限 :製造日期後 365 天 \\n內容量 : 100g x 6', 3, 11, '無麩質', '2023-10-16 18:25:17', 1),
(63, '香蕉布朗尼', 850, '我們的香蕉布朗尼蛋糕-它不僅是一款無麩質、無奶蛋的素食選擇，還擁有豐富的營養和令人驚艷的口感。\\n與經典布朗尼一樣，我們的布朗尼蛋糕散發著濃郁的巧克力香氣，但我們以黑豆取代麵粉，打破了傳統布朗尼的製作方法，創造出令人驚艷的口感。\\n黑豆與可可和諧融合，質地濃郁而豐富，完美匹配傳統布朗尼的稠度和質地，同時保留著獨特的風味。\r\n為了提升布朗尼的質地和味道，我們在中間添加了自製的巧克力醬和新鮮香蕉，為布朗尼增添了額外的營養價值和類似奶油的質感。\r\n此外，我們還加入了核桃碎，讓布朗尼的口感更加豐富，並增添堅果香氣。 無論您是否有蛋、奶、麩質飲食限制，我們的布朗尼都是一款更健康的完美的替代甜點，每一口都能滿足您對美味甜點的需求。', '商品產地 : 台灣\\n賞味期限 : 冷凍最佳賞味期2週、冷藏最佳賞味期3天\\n內容量 : 850g x 1', 2, 6, '無麩質,蛋奶素', '2023-10-16 18:25:17', 1),
(64, '【森果香】森林派對鐵盒餅乾/54入', 757, '森林派對鐵盒餅乾 クッキー缶(蛋奶素)\\n「闖入森林的你，就是我們一起探索驚奇的“仲間”。」⁣\\n美味與造型兼具的可愛組合\\n54入來自天然食材與純手工堅持的燒菓子⁣', '商品產地 : 台灣\\n賞味期限 : 製造日期後 15 天\\n內容量 : 477g x 1', 2, 7, '蛋奶素,送禮', '2023-10-16 18:25:17', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `product_img`
--

CREATE TABLE `product_img` (
  `product_img_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `product_img` varchar(300) DEFAULT NULL,
  `showed_1st` int(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product_img`
--

INSERT INTO `product_img` (`product_img_id`, `product_id`, `product_img`, `showed_1st`) VALUES
(159, 27, '2701.jpg', 1),
(160, 27, '2702.jpg', 0),
(161, 27, '2703.png', 0),
(162, 28, '2801.png', 1),
(163, 28, '2802.jpg', 0),
(164, 29, '2901.jpg', 1),
(165, 29, '2902.png', 0),
(166, 30, '3001.png', 1),
(167, 30, '3002.jpg', 0),
(168, 31, '31.png', 1),
(169, 32, '3201.png', 1),
(170, 32, '3202.jpg', 0),
(171, 33, '33.png', 1),
(172, 34, '3401.png', 1),
(173, 34, '3402.jpg', 0),
(174, 35, '3501.png', 1),
(175, 35, '3502.jpg', 0),
(176, 36, '3601.jpg', 1),
(177, 36, '3602.jpg', 0),
(178, 37, '3701.png', 1),
(179, 37, '3702.jpg', 0),
(180, 38, '3801.png', 1),
(181, 38, '3802.jpg', 0),
(182, 39, '39.png', 1),
(183, 40, '4001.png', 1),
(184, 40, '4002.jpg', 0),
(185, 41, '41.png', 1),
(186, 42, '42.jpg', 1),
(187, 43, '43.jpg', 1),
(188, 44, '44.jpg', 1),
(189, 45, '4501.jpg', 1),
(190, 45, '4502.jpg', 0),
(191, 46, '4601.jpg', 1),
(192, 46, '4602.jpg', 0),
(193, 47, '4701.jpg', 1),
(194, 47, '4702.jpg', 0),
(195, 48, '48.png', 1),
(196, 49, '4901.jpg', 1),
(197, 49, '4902.jpg', 0),
(198, 50, '50.jpg', 1),
(199, 51, '51.jpg', 1),
(200, 52, '52.jpg', 1),
(201, 53, '53.png', 1),
(202, 54, '5401.png', 1),
(203, 54, '5402.jpg', 0),
(204, 55, '5501.jpg', 1),
(205, 55, '5502.jpg', 0),
(206, 56, '5601.png', 1),
(207, 56, '5602.png', 0),
(208, 57, '5701.png', 1),
(209, 57, '5702.png', 0),
(261, 58, '58.png', 1),
(262, 59, '59.png', 1),
(263, 61, '61.jpg', 1),
(267, 62, '6201.png', 1),
(268, 62, '6202.png', 0),
(269, 63, '63.png', 0),
(270, 64, '6401.png', 1),
(271, 64, '6402.jpg', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `product_item`
--

CREATE TABLE `product_item` (
  `item_id` int(11) NOT NULL,
  `item_name` varchar(300) NOT NULL,
  `product_type_list_id` varchar(100) NOT NULL,
  `price_range` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='商品篩選(tags)';

--
-- 傾印資料表的資料 `product_item`
--

INSERT INTO `product_item` (`item_id`, `item_name`, `product_type_list_id`, `price_range`) VALUES
(6, '無添加', '3,4,6,12,14,16,18', 0),
(7, '無麩質', '6,7,8,10,11,14', 0),
(8, '蛋奶素', '6,7,8,9,10,15,17,18', 0),
(9, '送禮', '1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `product_item_detail`
--

CREATE TABLE `product_item_detail` (
  `product_item_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product_item_detail`
--

INSERT INTO `product_item_detail` (`product_item_id`, `product_id`, `item_id`) VALUES
(1, 28, 8),
(2, 47, 6),
(3, 48, 9),
(4, 59, 9),
(5, 45, 9),
(6, 52, 6),
(7, 51, 9),
(8, 58, 9),
(9, 29, 9),
(10, 40, 9),
(11, 39, 7),
(12, 39, 8),
(13, 34, 9),
(14, 32, 9),
(15, 31, 8),
(16, 35, 9),
(17, 41, 9),
(18, 37, 8),
(19, 37, 9),
(21, 33, 8),
(41, 42, 9),
(43, 57, 6),
(45, 57, 9),
(46, 27, 9),
(47, 30, 9),
(48, 43, 9),
(49, 44, 9),
(50, 62, 7),
(51, 63, 7),
(52, 63, 8),
(53, 64, 8),
(54, 64, 9),
(55, 39, 9),
(56, 47, 9),
(57, 51, 6);

-- --------------------------------------------------------

--
-- 資料表結構 `product_type`
--

CREATE TABLE `product_type` (
  `product_type_id` int(11) NOT NULL,
  `product_type_name` varchar(300) NOT NULL,
  `isValid` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='商品大種類';

--
-- 傾印資料表的資料 `product_type`
--

INSERT INTO `product_type` (`product_type_id`, `product_type_name`, `isValid`) VALUES
(1, '飲品/沖泡類', 1),
(2, '烘焙食品/甜點', 1),
(3, '休閒零食', 1),
(4, '烹料料理', 1),
(5, '其他', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `product_type_list`
--

CREATE TABLE `product_type_list` (
  `product_type_list_id` int(11) NOT NULL,
  `product_type_id` int(11) NOT NULL,
  `product_type_list_name` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `isValid` int(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='商品小種類';

--
-- 傾印資料表的資料 `product_type_list`
--

INSERT INTO `product_type_list` (`product_type_list_id`, `product_type_id`, `product_type_list_name`, `isValid`) VALUES
(1, 1, '茶類', 1),
(2, 1, '咖啡/咖啡豆', 1),
(3, 1, '果汁', 1),
(4, 1, '醋/水果醋', 1),
(5, 1, '酒類', 1),
(6, 2, '蛋糕/甜點', 1),
(7, 2, '手工餅乾', 1),
(8, 2, '麵包/吐司', 1),
(9, 2, '奶酪/布丁/果凍', 1),
(10, 3, '零食', 1),
(11, 3, '糖果/巧克力', 1),
(12, 3, '果醬/抹醬', 1),
(13, 3, '水果乾', 1),
(14, 3, '堅果/穀物', 1),
(15, 4, '熟食/冷藏、冷凍食品', 1),
(16, 4, '米/麵條', 1),
(17, 4, '調理包/料理包', 1),
(18, 4, '調味料/醬料', 1),
(19, 5, '其他', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `restaurant_opening_hours`
--

CREATE TABLE `restaurant_opening_hours` (
  `id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `day_of_week` int(11) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `is_open` int(1) NOT NULL,
  `max_capacity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `restaurant_opening_hours`
--

INSERT INTO `restaurant_opening_hours` (`id`, `restaurant_id`, `day_of_week`, `start_time`, `end_time`, `is_open`, `max_capacity`) VALUES
(1, 1, 6, '11:00:00', '20:00:00', 1, 30),
(2, 1, 0, '11:00:00', '20:00:00', 1, 30),
(3, 1, 1, '00:00:00', '00:00:00', 0, 30),
(4, 1, 2, '11:00:00', '20:00:00', 1, 30),
(5, 1, 3, '11:00:00', '20:00:00', 1, 30),
(6, 1, 4, '11:00:00', '20:00:00', 1, 30),
(7, 1, 5, '11:00:00', '20:00:00', 1, 30),
(11, 2, 6, '11:00:00', '20:00:00', 1, 30),
(12, 2, 0, '11:00:00', '20:00:00', 1, 30),
(13, 2, 1, '12:00:00', '20:00:00', 0, 30),
(14, 2, 2, '12:00:00', '20:00:00', 1, 30),
(15, 2, 3, '12:00:00', '20:00:00', 1, 30),
(16, 2, 4, '12:00:00', '20:00:00', 1, 30),
(17, 2, 5, '12:00:00', '20:00:00', 1, 30),
(18, 3, 6, '12:00:00', '21:00:00', 1, 30),
(19, 3, 0, '12:00:00', '21:00:00', 1, 30),
(20, 3, 1, '17:00:00', '21:00:00', 1, 30),
(21, 3, 2, '17:00:00', '21:00:00', 1, 30),
(22, 3, 3, '17:00:00', '21:00:00', 1, 30),
(23, 3, 4, '17:00:00', '21:00:00', 1, 30),
(24, 3, 5, '17:00:00', '21:00:00', 1, 30),
(25, 4, 6, '11:00:00', '21:00:00', 1, 30),
(26, 4, 0, '11:00:00', '21:00:00', 1, 30),
(27, 4, 1, '11:00:00', '21:00:00', 1, 30),
(28, 4, 2, '11:00:00', '21:00:00', 1, 30),
(29, 4, 3, '11:00:00', '21:00:00', 1, 30),
(30, 4, 4, '11:00:00', '21:00:00', 1, 30),
(31, 4, 5, '11:00:00', '21:00:00', 1, 30),
(32, 5, 6, '11:00:00', '22:00:00', 1, 30),
(33, 5, 0, '11:00:00', '22:00:00', 1, 30),
(34, 5, 1, '11:00:00', '22:00:00', 1, 30),
(35, 5, 2, '11:00:00', '22:00:00', 1, 30),
(36, 5, 3, '11:00:00', '22:00:00', 1, 30),
(37, 5, 4, '11:00:00', '22:00:00', 1, 30),
(38, 5, 5, '11:00:00', '22:00:00', 1, 30),
(39, 6, 6, '11:00:00', '21:00:00', 1, 30),
(40, 6, 0, '11:00:00', '21:00:00', 1, 30),
(41, 6, 1, '11:00:00', '21:00:00', 1, 30),
(42, 6, 2, '11:00:00', '21:00:00', 1, 30),
(43, 6, 3, '11:00:00', '21:00:00', 1, 30),
(44, 6, 4, '11:00:00', '21:00:00', 1, 30),
(45, 6, 5, '11:00:00', '21:00:00', 1, 30),
(46, 7, 6, '11:00:00', '18:00:00', 1, 30),
(47, 7, 0, '11:00:00', '18:00:00', 1, 30),
(48, 7, 1, '11:00:00', '18:00:00', 1, 30),
(49, 7, 2, '11:00:00', '18:00:00', 1, 30),
(50, 7, 3, '11:00:00', '18:00:00', 1, 30),
(51, 7, 4, '11:00:00', '18:00:00', 1, 30),
(52, 7, 5, '11:00:00', '18:00:00', 1, 30),
(53, 8, 6, '11:00:00', '20:00:00', 1, 30),
(54, 8, 0, '11:00:00', '20:00:00', 1, 30),
(55, 8, 1, '11:00:00', '22:00:00', 1, 30),
(56, 8, 2, '11:00:00', '22:00:00', 1, 30),
(57, 8, 3, '11:00:00', '22:00:00', 1, 30),
(58, 8, 4, '11:00:00', '22:00:00', 1, 30),
(59, 8, 5, '11:00:00', '22:00:00', 1, 30);

-- --------------------------------------------------------

--
-- 資料表結構 `restaurant_user`
--

CREATE TABLE `restaurant_user` (
  `restaurant_id` int(11) NOT NULL,
  `restaurant_name` varchar(100) NOT NULL,
  `restaurant_password_hash` varchar(255) NOT NULL,
  `restaurant_email` varchar(255) NOT NULL,
  `restaurant_phone` varchar(30) NOT NULL,
  `restaurant_city` varchar(10) NOT NULL,
  `restaurant_district` varchar(10) NOT NULL,
  `restaurant_address` varchar(50) NOT NULL,
  `restaurant_opening` varchar(300) NOT NULL,
  `restaurant_info` varchar(1000) NOT NULL,
  `restaurant_avatar` varchar(300) NOT NULL,
  `restaurant_gmail` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `restaurant_user`
--

INSERT INTO `restaurant_user` (`restaurant_id`, `restaurant_name`, `restaurant_password_hash`, `restaurant_email`, `restaurant_phone`, `restaurant_city`, `restaurant_district`, `restaurant_address`, `restaurant_opening`, `restaurant_info`, `restaurant_avatar`, `restaurant_gmail`) VALUES
(1, 'Cin Cin Osteria 請請義大利餐廳', '', '', '02-2712-2050', '台北市', '松山區', '慶城街16巷16號', '每周一休息\\n\\n\n\n週二至週五 11:00-21:00 (最後點餐20:00)\\n\n週六至週日 11:00-21:00 (最後點餐20:00)\\n\n', '堅持原型食材，簡單調味，我們只提供我們自己也吃的食物。堅持使用台灣島嶼的當季農產與、新鮮現流海鮮漁獲，和進口的調味品，所融合出的義式料理餐廳。\\n\\n\n\n*** 為了提供貴客完美用餐體驗與品質、尊重員工及其他用餐客人，以下說明請您詳閱，謝謝您的體諒與配合 ****\\n\\n\n\n１．訂位保留 10 分鐘，如逾時將視場狀況重新安排座位。每一輪用餐限時 2 小時\\n\n２．低消為每人累積點滿 $150、加收 10% 服務費\\n\n３．本系統接受 60 天內訂位。若需取消或更改訂位，請提前線上操作或來電告知\\n\n４．提供兒童專用安全餐具及座位，您可於線上訂位時留言告知需求\\n\n５．提供部分蛋奶素餐點，請參考菜單上綠色標示\\n\n６．本餐廳未販售酒精類飲品，若您欲攜帶酒類進場不加收開瓶費\\n\n７．超過８人用餐之訂位，請直接致電我們將為您特別安排\\n', '', ''),
(2, '晴木千層豬排', '$2y$10$Tl4Cv5nrPBP5oQxXEmYhmOrlpGXyIvzSPZgxSJjZhtBg.80VMarai', 'qingmu@gmail.com', '04-2656-7969', '台中市', '梧棲區', '臺灣大道十段168號', '每週一休息\\n\\n\r\n\r\n1.週二到週五：12:00-21:30\\n\r\n（最後點餐時間為20:30）\\n\r\n2.週六、週日及連續假日：10:30-21:30\\n\r\n（最後點餐時間為20:30）\\n\r\n', '日本國民元氣美食 ─ 豬排有新吃法，晴木千層豬排擁有獨家技術，日本同業爭相模仿，讓晴木千層豬排擁有，日本「千層豬排始祖」的封號。\\n\\n\r\n\r\n千層豬排使用緊實，保水度高的大里肌豚肉，每層肉片超薄切，使用獨家技術層層堆砌，低溫油炸後垂直靜置，讓熱氣均勻擴散到內部，保持外酥內嫩的多汁口感。\\n\\n\r\n\r\n除此之外，晴木也推出不同組合，包含頂級桐德黑豚，鮮甜如蜜黑蜜豚，饕客專屬澳洲牛菲力，豐富多樣化的套餐選擇，絕對讓每位來到晴木的客人，享受極致美味的餐點，擁有最優質的服務。\\n\\n', '', ''),
(3, 'BORNGA本家韓式燒肉 敦南店', '', '', '02-2752-5358', '台北市', '大安區', '市民大道四段102號', '無固定休息日\\n\\n\n\n週一 ~ 週五： \\n\n下午5:00 - 下午11:00\\n\n\n週六 、週日： \\n\n下午12:00 - 下午11:00\\n\n', '白種元插旗台灣，首間Bornga韓式燒肉餐廳，堪稱韓國博物館等級的燒肉餐廳，期待您的光臨!!\\n\\n\n\n來自韓國的品牌-本家，\\n\n呈現正統韓國菜餚是本家的使命，\\n\n由白種元老師研發帶有韓國經典特色的佳餚，滿足每位顧客的味蕾。\\n\\n\n\n我們致力於提供最好的韓國飲食文化體驗，將一貫保持呈現「美味、正宗、親切以及健康飲食」的理念，期待您的蒞臨用餐。\\n\\n\n\n※訂位規則:\\n\n開放30天內的訂位預約。\\n\n訂位等候時間為10分鐘，逾期即取消，由現場貴賓直接遞補。\\n\n為了提供最好的服務品質，部份座位則視當日現場營運狀況開放現場候位貴賓。\\n\n用餐時間120分鐘。\\n\n提供獨立包廂，最多入座12位貴賓，低消為15000元不含服務費。（如需要請至臉書粉絲專頁留言詢問）\\n\\n\n\n※本店消費模式:\\n\n每桌備有基本開胃解膩冷湯以及三種小菜(可續)。\\n\n點選兩份燒烤類肉品，加贈送燒烤類小菜(可續)以及豪華生菜盤乙份。\\n\n本店以協助貴賓自助燒烤為主，非全程桌邊服務。\\n\n◆自112年起，每人低消$600元。\\n\n（12歲以下兒童不算低消）\\n\\n\n\n※注意事項:\\n\n禁帶寵物及外食。\\n\n本店未提供電話服務。\\n\n本店未提供素食。\\n\n歡迎慶生，可攜帶蛋糕。\\n\n本店料理不提供客製化調整，秉持與韓國一致的口味。\\n', '', ''),
(4, '丰禾 台式小館', '', '', '04-2482-3568', '台中市', '大里區', '德芳南路476號', '無固定休息日\\n\\n\n\n週一 ~ 週日\\n\n上午11:00 - 下午10:00\\n', '我們是王品集團經典臺菜12強餐廳🍴，歡迎您闔家光臨來呷飯配菜😋\\n\\n\n\n訂位注意事項\\n\n1.目前開放「一個月內」的訂位，例如：要預訂3/1位置，請於2/1之後進行訂位。\\n\n2.如有多人訂位需求，請撥打門店電話。\\n\n3.訂位保留10分鐘，逾時將自動取消座位。\\n\n4.本餐廳保留條款內容變更與解釋、暫停或終止本線上訂位之權利。\\n\n', '', ''),
(5, '岩漿火鍋 台中公益店', '', '', '04-2383-0868', '台中市', '南屯區', '公益路二段889號', '無固定休息日\\n\\n\n\n週一 ~ 週日\\n\n11:00-24:00\\n\n', '以養身為本的岩漿火鍋，堅持遵循傳統古法熬製的信念。\\n\\n\n\n【內用消費】\\n\n１.單一鍋底每人150元，\\n\n　 鴛鴦鍋每桌加收180元，\\n\n　 每桌低消950元。\\n\n２.身高未滿120cm之小朋友不計鍋底費用。\\n\n３.用餐時間1小時40分鐘。\\n\n４.店內消費需加10%服務費。\\n\n５.湯底、酒水、服務費不折扣。\\n\\n\n\n【外帶消費】\\n\n１.外帶鍋底每份450元，\\n\n　 需外加500元食材，\\n\n　 低消950元。\\n\n\n２.不另收10%服務費。', '', ''),
(6, '樂崎火鍋 板橋店', '', '', '02-2951-0681', '新北市', '板橋區', '四川路一段57號', '無固定休息日\\n\\n\n\n週一 ~ 週日\\n	\n11:00-23:00\\n\n', '樂崎火鍋堅持每日自熬柴魚雞骨火鍋湯底、加入各種優質好食材\\n\n​湯頭王的魅力從嚐到到湯第一口開始！\\n\\n\n\n超過六人需要拆開坐，八人(含)以上需付訂金一千元，用餐尖峰時段視現場狀況可能會安排併桌\\n\\n\n\n====================================\\n\\n\n​\n「絕對滿足系火鍋」怎麼吃？\\n\n和牛龍蝦火鍋超級澎湃！\\n\n堅持每日熬煮柴魚雞骨火鍋湯底\\n\n​提供新鮮食材的海鮮涮涮鍋\\n\\n\n\n澳洲和牛、美國牛肉、台灣究好豬、台灣氣冷雞\\n\n肉盤片片現點現切，保持帶著肉汁的厚度\\n\n均勻油花、輕涮湯底後入口即化、饕客最愛！\\n\\n\n\n樂崎依不同時節提供季節限定食材\\n\n支持台灣在地肉品及農作品\\n\n大武山雞蛋、台梗九號米、產銷履歷蔬菜\\n\n鮮乳坊牛奶、南投冷泡紅茶、花蓮剝皮辣椒\\n\n​好食材、更安心\\n\\n\n', '', ''),
(7, '無聊咖啡 AMBI CAFÉ', '', '', '02-2775-5055', '台北市', '大安區', '敦化南路一段187巷37號', '每周一休息\\n\\n\n\n週二 ~ 週日\\n\n11:00~19:00\\n\n', '300坪大空間在東區Zara後面 | 下午茶、中式餐點、手作甜點 | 包場、聚餐、求婚、慶生、藝術課程 | 喧囂城市裡得以喘息的空間，歡迎一起來享受無聊。\\n\\n\n\n【預約訂位基本注意事項】\\n\\n\n\n本店僅接受14天內的線上訂位。\\n\\n\n\n為確保所有客人用餐權益及避免事先預備食材之浪費，如需取消或更改訂位，請提前告知。\\n\\n\n\n所有訂位保留10分鐘，如逾時將視現場狀況重新安排座位。\\n\\n\n\n用餐時間限時二小時，每位客人低消180元，酌收10%服務費。\\n\\n\n\n👶 兒童\\n\\n\n\n因店裡空間較大，請家長帶能自主用餐的孩童前來，但請勿放生孩童在店內嬉戲遊玩奔跑尖叫，造成其他客人的不便。\\n\\n\n\n本餐廳備有兩張兒童椅，如有特殊需求建議家長可自行攜帶。\\n\\n\n\n嬰兒推車於用餐時間請務必收起，並嚴禁在餐廳內來回推行。\\n\\n\n\n🚫 飲食限制或需求\\n\\n\n\n若您有飲食上的限制或需求，請務必於點餐時向服務人員提出，\\n\n我們會盡力滿足您的需求。\\n\\n\n\n🎂 慶生\\n\n欲攜帶蛋糕慶祝，請於訂位時告知或來電詢問，用餐完畢需自行帶走慶生活動之物品：如蛋糕盒等⋯\\n\\n\\n\\n\n\n特殊活動或包場\\n\n請聯繫Abby 王小姐 02-2775-5055\\n\\n\n\n📒 其他注意事項\\n\\n\n\n• 所有價格皆以新台幣標示，本店有加收一成服務費。\\n\n\n• 本店嚴禁攜帶外食及飲料，違者一律交由服務人員收回。\\n\n\n• 為避免影響到其他客人用餐環境，店內拍照嚴禁使用閃光燈、攝影器材、並嚴禁任何換裝外拍與商業攝影行為，服務人員保有權力制止與驅離。\\n\n\n• 為了提供每位貴客完美用餐體驗與品質，並尊重每位用心服務的員工，本餐廳特制定上述規範與說明，謝謝您的體諒與配合。\\n\\n\n', '', ''),
(8, '富美海鮮火鍋 宜蘭店', '', '', '03-9313807', '宜蘭縣', '宜蘭市', '宜興路一段48號', '無固定休息日\\n\\n\n\n週一 ~  週五　11:00-23:30\\n\n週六 、週日　11:00--22:00\\n', '以新鮮現撈現殺的海鮮結合傳統石頭火鍋，以多年的經驗累積挑選特色的湯頭及食材，帶來全新的石頭火鍋。特別聘請圓山飯店點心主廚製做道地的港式點心，結合創新的手法與傳統的美味。\\n\\n\n\n富美成立於1966年，當初由創辦人夫婦從租來的一個小舖子開始富美的第一家店，那時就叫〈富美小吃部〉。，在南方澳這個小漁村生根，當年交通仍未便利，富美的客戶絕大部份是當地的居民，創辦人夫婦秉持著「實在」的精神在當地創下口碑，深得當地居民的信賴。\\n\\n\n\n1970年 終於擁有自己的店面，那時候就叫〈富美食堂〉，第二代陸續加入富美的經營，全家人仍秉持 \"實在\" 的精神，除了在地人的支持外，在交通便利的條件下全省各地民眾來到南方澳用餐，富美就是大部分民眾的首選。\\n\n2002年 位於巷子內的店面，以不敷使用，就在南方澳海邊路成立富美活海鮮。\\n\\n\n\n2007年 北宜高開通後就在臺北市南港區開了第一家分店。\\n\n2013年 富美用累積多年的經驗挑選出最受顧客歡迎的湯頭及不同市面上的火鍋食材，以及親切的服務，優雅的空間設計，在羅東鎮民生路六號二樓成立第一家以火鍋為主的〝富美海鮮火鍋〞。\\n\\n\n\n2016年 現在富美要做一個創新創意的火鍋店，以新鮮現撈現殺的海鮮結合傳統石頭火鍋，以多年的經驗累積挑選特色的湯頭及食材，帶來全新的石頭火鍋。特別聘請圓山飯店點心主廚製做道地的港式點心，結合創新的手法與傳統的美味。\\n\\n\n\n', '', ''),
(9, '赤鐵廣島燒專賣店 - 民權店', '', '', '02-2592-7178', '台北市', '中山區', '撫順街12號', '無固定休息日', '歡迎來到我們的廣島燒店！我們的店家致力於為您呈現正宗的日本廣島燒料理，結合台灣的獨特風味，帶給您一場美食之旅。\n\n我們的廣島燒師傅們都具有豐富的烹飪經驗，他們將用心為您準備新鮮的食材，包括新鮮的海鮮、優質的肉類和新鮮蔬菜。我們的廣島燒以其特有的多層次口感而聞名，每一口都充滿了美味和驚喜。\n\n在我們的餐廳，您可以享受到舒適的用餐環境，我們設計了獨特的用餐區域，以滿足各種用餐需求，無論是與家人、朋友或同事共進晚餐。此外，我們也提供友善的服務，以確保您有一個愉快的用餐體驗。\n\n我們的廣島燒店致力於提供優質的食物和服務，讓您品味到日本廣島燒的真正風味，不論您是廣島燒愛好者還是初次品嚐，我們都歡迎您的光臨。期待能為您提供一個獨特而美味的餐飲體驗！\n\n\n\n\n', '', ''),
(10, '魚韻日式料理', '', '', ' 02-2706-9629', '台北市', '大安區', '瑞安街208巷24弄14號', '無固定休息日', '「用心做好每一道料理，讓魚的韻味留在每位客人的心中便是我們的初衷。」這是魚韻日式生魚片餐廳的經營理念，我們深信於料理的藝術，以極大的熱情與才華將生魚片提升至一種藝術形式。在這個寧靜且充滿風情的餐廳，您將品味到最優美的生魚片佳餚。\n\n魚韻的主廚是一位極具經驗的大廚，擁有多年的廚藝經驗，對於日本料理有著無比的熱情。每天，他精挑細選最新鮮的海鮮，包括各種魚類、貝類和章魚，確保每一片生魚片都帶著原汁原味。\n\n除了美味的生魚片，魚韻還提供優雅的用餐環境。木質裝潢、柔和的照明和傳統的日本音樂共同營造出一個極具禪意的用餐體驗。無論是與摯友共聚，或是浪漫的約會，這裡都是個完美的選擇。\n\n我們期望每一位客人都能在魚韻找到自己的日本美食之旅，讓魚的韻味留在您的心中。歡迎您前來品味我們的料理，感受層層韵味交織的味蕾盛宴。', '', ''),
(11, '幼瀨明月和菓子茶屋', '', '', '02-2758-1585', '台北市', '中山區', '民權東路一段9號', '無固定休息日', '【幼瀨明月】是由「幼瀨伍號」及「明月堂」兩個臺灣品牌聯手打造、首創且獨一無二，茶與甜品的聯名品牌。\n\n自西元1850年(清道光30年)至今，栽種、製作臺灣茶已傳承一百七十年的臺灣第一莊園茶品「幼瀨伍號」，與西元1935年(昭和10年)創立至今、開啟屬於臺灣道地精緻和菓子志業，傳承近百年的和菓子老舖「明月堂」，攜手創立【幼瀨明月】。\n\n一口茶、一口和菓子，兩者結合而成穿越味覺時光隧道的臺灣下午茶經典滋味，目前有多家門市，分別以和菓子茶屋、料理亭、產品舖等三種型態呈現。\n\n【幼瀨明月】產品，除了涵蓋「幼瀨伍號」莊園茶品及「明月堂」甜品，亦憑藉著對臺灣茶及臺灣道地甜食完美究極的專業優勢，嚴選臺灣在地好茶及各式甜點，並與臺灣藝術家合作，以視覺上唯美的方式呈現，詮釋記憶中完整的臺灣味。', '', ''),
(12, 'アツアツ章魚燒', '', '', '02-2562-5286', '台北市', '中山區', '中山北路一段83巷11-2號', '每週一、二休息', '我們的章魚燒是結合了傳統烹飪技巧和現代創意的結晶。我們的廚師們對每一道料理都注入了熱情和精湛的技藝，確保每顆章魚燒都達到了完美的外脆內嫩口感，以及令人愉悅的風味。\n\n不僅如此，我們還提供多種口味和配料的選擇，因為我們明白每位客人都有獨特的口味喜好。無論您喜歡經典的章魚燒還是想要嚐試一些新鮮的口味創新，我們都能滿足您的味蕾。', '', ''),
(13, '嚐居', '', '', '02-2502-3798', '台北市', '中山區', '農安街166巷11號', '無固定休息日', '在我們的居酒屋，您將品嚐到新鮮的生魚片、烤魚、炸物等經典日式美食，所有食材均為每日精心挑選，確保最高的品質和口感。我們的廚師們專注於保持傳統風味，同時也不斷嘗試新的創意料理，以滿足各種口味需求。\n\n我們的用餐環境充滿和風氛圍，安靜而寧靜，是享受美食和交流的理想場所。您可以在這裡放鬆身心，與朋友或家人一同度過美好時光。\n\n至於酒水，我們提供各種日本清酒、梅酒、啤酒和雞尾酒，滿足您的口味。無論您是喜歡傳統日本酒還是異國風情的調酒，我們都能滿足您的需求。', '', ''),
(14, '富士咖哩FujiCurry', '', '', '02-2737-2903', '台北市', '大安區', '臥龍街153號', '每週日休息', '我們以木質裝潢營造出寧靜的用餐環境，為您提供最純正的傳統日式咖哩料理。在這裡，每一道料理都是精心製作，保留了日本傳統咖哩的風味，並注入了獨特的烹飪技巧。\n\n我們的菜單提供多種選擇，從濃郁的咖哩飯到美味的咖哩烏冬，每一口都散發出濃郁的香氣和口感。無論您是咖哩愛好者還是想要嘗試新口味的食客，我們都歡迎您的到來。', '', ''),
(15, '鍋吉拉精緻火鍋', '', '', '02-2785-6511', '台北市', '南港區', '興中路38號', '無固定休息日', '米其林一星高湯做法，天然無負擔。\n以大量蔬菜、白蘿蔔、紅蘿蔔、洋蔥、\n甘蔗熬煮，\n同時我們還加入了多量的蘋果，\n讓湯頭的甜味與香氣再更升級！\n湯頭含有來自蔬菜、水果裡，\n豐富的維生素與礦物質，\n孕婦、小孩、副食品、年長者都非常適合的。\n常有客人外帶買回家，\n自己熬粥\n(這個湯頭熬粥真的超讚，\n再加個魚肉更是完美！)\n或者煮副食品給小寶貝吃，\n天然無負擔，省時又方便！\n\n消費方式：\n個人單點式鍋物_想吃什麼點什麼\n先選鍋物：\n再選肉(大、中、小，三種size選擇)\n或海鮮，再選配料、青菜\n也有綜合類：如綜合青菜、綜合阿中丸、蝦拼拼..等\n內用＿白飯/飲料/冰淇淋_無限供應\n◾️提供內用 / 外帶 \n◾️140cm以上需每人點一鍋，以下無限制\n◾️店內採QRcode線上點餐\n－', '', ''),
(16, '川鼎鍋物', '', '', '\n02-2567-9955', '台北市', '中山區', '長春路130號', '無固定休息日', '川鼎精緻鍋物｜台北火鍋是傳說中可以喝的麻辣鍋餐廳，用心對鍋物的堅持，在鍋底、肉品及海鮮上，都有一定的品質跟水準。\n\n川鼎精緻鍋物菜單必點：東北白菜湯、川味麻辣湯、霜降牛、鴨血\n\n川鼎精緻鍋物評價：Google 4.8 星超高評價\n\n川鼎精緻鍋物推薦：川鼎精緻鍋物位於捷運松江南京站，步行約 6 分鐘即可抵達，絕佳的地理位置，適合下班後約會聚餐的餐廳。', '', ''),
(17, '小尚品精制鍋物', '', '', '02-8661-8599', '台北市', '文山區', '木柵路一段325之3號', '無固定休息日', '【小尚品精制鍋物】緣起於基隆這座城市在地經營14年\n福興店傳承基隆老闆的好手藝而轉傳下來\n希望將新鮮食材讓更多在外遊子能夠品嘗到家的味道\n我跟員工說：【進來的客人一定要讓他們吃得飽】\n小尚品是一個平價小火鍋但在食材上完全不馬乎\n我們的海鮮每日從基隆漁港  新鮮直送\n小尚品鍋物福興店提供一個舒適又健康的用餐環境讓您享用美食', '', ''),
(18, '22:02 火鍋。樂活', '', '', '02-2748-2202', '台北市', '松山區', '八德路四段17巷7號', '無固定休息日', '我們的開始，是想把最自然的的食材帶給消費者。因為過去我們曾經營了吃到飽的火鍋店，當時選擇的食材真的無法使用較好的食材且多數是加工的丸子。海產 肉品 蔬果都無法選擇較好的食材，當時我們所販售的價格是一個人頭350 也沒有含服務費。羊毛出在羊身上，是這樣說的吧。再回過頭來，我們只想把好的東西拿出來給消費者，且要對得起自己的良心，把消費者當成如同自己家人般，那事情就會簡單多了。\n \n我們開始尋找有機的蔬菜，無添加的食品，肉類海鮮都是自己先吃過再決定是否可以提供給大家。店內呈現的風格也因著朝有機天然的方向，想讓大家印象深刻。於是想把\"\"自然\"\"帶進來店裡，讓大家能夠感受不同。而店內一進門的植栽牆及原木裝潢就是用這樣的概念去設計去呈現的。\n \n所有方向都清楚了且順利完成，但是生意卻不如預期。一開始的生意只能說真是糟透了來說。我們進貨來的蔬果幾乎都是自己吃掉居多，但消耗有限，我們自己根本吃不完，老闆心疼不已。想著一定要讓這樣的好東西讓大家都吃到，且不浪費。\n \n我們的有機蔬菜醬料就是這樣來的。在消費者還無法接受蔬菜有機卻是不完美的狀態下，及當時我們吃不完的狀況下研發出來的，沒想到變成一大特色(笑)，這真的讓我們感到意外，但卻非常感激。\n \n到目前為止，我們還都在努力當中，只希望能盡力去做，做個讓消費者真的能放心選擇的店家，現在，也開始販售店內所使用的蔬果了，歡迎大家來吃鍋買健康。', '', ''),
(19, 'Lady nara曼谷新泰式料理', '', '', '02-2651-7338', '台北市', '南港區', '忠孝東路七段299號C棟', '無固定休息日', '曼谷新泰式料理「Lady nara」擁有泰國曼谷最強網美餐廳之美譽，亦是米其林推薦泰式料理NARA Thai Cuisine其姐妹品牌， 全球海外首店橫跨2500公里，2019年4月於台灣零距離登場。\n\nLady nara在英文和泰文中皆意旨「女人」，用餐環境跟泰國本店採相同風格。專為女性設計大自然花園般的舒適慵懶風，運用米、白、粉幾何形狀與溫柔色調的餐具、泰國海運來台的手工籐編孔雀椅，打造別出心裁、時尚優雅的客席氛圍。\n\n起源於創辦人Yuki Srikarnchana旅居世界各地的生活經歷，將獲獎無數真實力的傳統泰國料理手法，精采融合在全球的特色料理中！打破傳統泰食文化，在曼谷掀起一股新泰食風潮，完美呈現輕食、鹹食、甜點與特色飲品，從一人獨享到多人聚餐皆宜。Lady nara完全顛覆你的味蕾，猶如漫遊世界般地令人驚艷！', '', ''),
(20, 'Cun Siou Jia 村秀家', '', '', '02-2595-5871', '台北市', '大同區', '昌吉街4-1號', '無固定休息日', '以其經典綜合水果千層蛋糕而聞名遐邇。各種千層蛋糕口味，包括草莓、小山園抹茶、可可香蕉等，每一款都融合了口感的完美和新鮮水果的鮮美滋味。不僅如此，村秀家也以其日式蛋糕捲和戚風蛋糕等甜點而聞名。這裡的甜品選擇豐富多樣，讓您可以品味到最正宗的千層蛋糕風味。\n\n除了令人垂涎的點心，村秀家的環境也十分優雅。店內裝潢精美，營造出一個寧靜的下午茶體驗環境。無論是與摯友相約或是家人共度悠閒時光，這裡都是個絕佳的選擇。\n\n如果您正在尋找一個能夠滿足您甜品愛好的地方，村秀家是您的理想之選。來店，品味這個下午茶餐廳的獨特美味，讓您的味蕾沉醉其中，體驗甜蜜的時光。', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `r_feature`
--

CREATE TABLE `r_feature` (
  `r_feature_id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `r_feature_name` varchar(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `r_feature`
--

INSERT INTO `r_feature` (`r_feature_id`, `restaurant_id`, `r_feature_name`) VALUES
(1, 1, '素食'),
(2, 1, '寵物友善'),
(3, 2, '獨家技術'),
(4, 2, '免費停車'),
(5, 2, '免服務費');

-- --------------------------------------------------------

--
-- 資料表結構 `r_food_tag`
--

CREATE TABLE `r_food_tag` (
  `r_food_tag_id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `food_tag_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `r_food_tag`
--

INSERT INTO `r_food_tag` (`r_food_tag_id`, `restaurant_id`, `food_tag_id`) VALUES
(1, 1, 7),
(24, 1, 9),
(2, 1, 26),
(3, 1, 28),
(4, 2, 3),
(70, 2, 20),
(5, 2, 26),
(6, 2, 28),
(9, 3, 4),
(7, 3, 26),
(8, 3, 28),
(10, 4, 1),
(72, 4, 15),
(11, 4, 26),
(13, 4, 28),
(16, 5, 12),
(17, 5, 26),
(18, 5, 28),
(47, 6, 12),
(48, 6, 26),
(49, 6, 28),
(19, 7, 19),
(20, 7, 23),
(22, 7, 25),
(23, 7, 27),
(25, 8, 12),
(26, 8, 26),
(27, 8, 28),
(28, 9, 3),
(29, 9, 26),
(30, 9, 28),
(31, 10, 3),
(32, 10, 26),
(33, 10, 28),
(34, 11, 3),
(35, 11, 17),
(36, 11, 23),
(46, 11, 27),
(37, 12, 3),
(73, 12, 22),
(38, 12, 26),
(39, 12, 28),
(40, 13, 3),
(71, 13, 18),
(41, 13, 26),
(42, 13, 28),
(43, 14, 3),
(44, 14, 26),
(45, 14, 28),
(50, 15, 12),
(51, 15, 26),
(52, 15, 28),
(53, 16, 12),
(54, 16, 26),
(55, 16, 28),
(56, 17, 12),
(57, 17, 26),
(58, 17, 28),
(59, 18, 12),
(60, 18, 26),
(61, 18, 28),
(62, 19, 10),
(63, 19, 26),
(65, 19, 27),
(64, 19, 28),
(66, 20, 3),
(68, 20, 19),
(67, 20, 23),
(69, 20, 27);

-- --------------------------------------------------------

--
-- 資料表結構 `r_img`
--

CREATE TABLE `r_img` (
  `r_img_id` int(11) NOT NULL,
  `restaurant_id` int(11) NOT NULL,
  `r_img_route` varchar(80) NOT NULL,
  `r_img_isValid` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `r_img`
--

INSERT INTO `r_img` (`r_img_id`, `restaurant_id`, `r_img_route`, `r_img_isValid`) VALUES
(1, 1, 'r1-1.png', 1),
(2, 1, 'r1-2.png', 1),
(4, 1, 'r1-4.png', 1),
(5, 2, 'r2-1.jpg', 1),
(6, 2, 'r2-2.jpg', 1),
(7, 2, 'r2-3.jpg', 1),
(8, 2, 'r2-4.jpg', 1),
(9, 3, 'r3-1.jpg', 1),
(10, 3, 'r3-2.jpg', 1),
(11, 3, 'r3-3.jpg', 1),
(12, 3, 'r3-4.jpg', 1),
(13, 4, 'r4-1.jpg', 1),
(14, 4, 'r4-2.jpg', 1),
(15, 4, 'r4-3.jpg', 1),
(16, 4, 'r4-4.jpg', 1),
(18, 5, 'r5-1.jpg', 1),
(19, 5, 'r5-2.jpg', 1),
(20, 5, 'r5-3.jpg', 1),
(21, 5, 'r5-4.jpg', 1),
(22, 6, 'r6-1.jpg', 1),
(24, 6, 'r6-2.webp', 1),
(25, 6, 'r6-3.jpg', 1),
(26, 7, 'r7-1.jpg', 1),
(27, 7, 'r7-2.jpg', 1),
(28, 7, 'r7-3.jpg', 1),
(30, 8, 'r8-1.jpg', 1),
(31, 8, 'r8-2.jpg', 1),
(32, 8, 'r8-3.jpg', 1),
(33, 8, 'r8-4.jpg', 1),
(34, 8, 'r8-5.jpg', 1),
(35, 9, 'r9.jpg', 1),
(36, 10, 'r10.jpg', 1),
(37, 11, 'r11.jpg', 1),
(38, 12, 'r12.jpg', 1),
(39, 13, 'r13.jpg', 1),
(40, 14, 'r14.jpg', 1),
(41, 15, 'r15.jpg', 1),
(42, 16, 'r16.jpg', 1),
(43, 17, 'r17.jpg', 1),
(44, 18, 'r18.webp', 1),
(45, 19, 'r19.jpg', 1),
(46, 20, 'r20.jpg', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `sessions`
--

CREATE TABLE `sessions` (
  `session_id` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `expires` int(11) UNSIGNED NOT NULL,
  `data` mediumtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `user_id` int(11) NOT NULL,
  `user_name` varchar(50) NOT NULL,
  `nickname` varchar(50) NOT NULL,
  `user_password` varchar(30) NOT NULL,
  `user_phone` varchar(30) NOT NULL,
  `user_email` varchar(80) NOT NULL,
  `user_img` varchar(100) DEFAULT NULL,
  `self_intr` varchar(500) NOT NULL,
  `create_date` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `last_login_time` datetime NOT NULL,
  `isValid` int(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `user`
--

INSERT INTO `user` (`user_id`, `user_name`, `nickname`, `user_password`, `user_phone`, `user_email`, `user_img`, `self_intr`, `create_date`, `updatetime`, `last_login_time`, `isValid`) VALUES
(1, '張丹喬', '食界Jordan', '1234', '0972324551', 'jordan@gmail.com', 'man1.jpg', '大俠愛吃漢堡包，純正牛肉吃得飽，台北市民添口福，吃過就是乖寶寶。', '2023-07-23 10:26:43', '2023-07-23 10:26:43', '2023-07-23 10:26:43', 1),
(2, 'testman', 'test', 'test', '0911111111', 'test@gmail.com', 'd052fd2d-92e5-4ada-9e63-748119c3e185.jpg', '我只是測試用~', '2023-07-22 10:51:57', '2023-07-23 10:51:57', '2023-07-24 10:51:57', 1),
(3, '何筱雯', '雯雯', '1234', '0922664239', 'wenwen@gmail.com', 'gril3.jpg', '愛吃美食的小仙女，什麼都能省，就是吃不能省\r\n這裡就是我的備忘錄，沒有文謅謅的長篇大論，只有最真實簡單的主觀紀錄，提醒自己不要再踩雷了。', '2023-07-23 10:58:05', '2023-07-23 10:58:05', '2023-07-23 10:58:05', 1),
(4, '羅佑興', 'YOyoyo', '1234', '0936148346', 'yoyo@gmail.com', 'man4.jpg', '歡迎追蹤我~一起分享美食(^^♪', '2023-07-23 11:19:32', '2023-07-23 11:19:32', '2023-07-23 11:19:32', 1),
(5, '夏佩和', '?佩佩?', '1234', '0988164123', 'panpan@gmail.com', 'gril5.jpg', '', '2023-07-23 14:34:40', '2023-07-23 14:34:40', '2023-07-23 14:34:40', 1),
(6, '林建文', '賤賤a蚊蚊', '1234', '0958555292', 'a1234@yahoo.com', 'man6.jpg', '友善，包容，尊重。', '2023-07-23 14:35:37', '2023-07-23 14:35:37', '2023-07-23 14:35:37', 1),
(7, '姚美玲', 'YaoMelLing', '1234', '0921511203', 'melling@gmail.com', 'gril7.jpg', 'IG:melling1203', '2023-07-23 14:35:37', '2023-07-23 14:35:37', '2023-07-23 14:35:37', 1),
(8, '黃慧玲', '☎ling~ling', '1234', '0963362192', 'lingling@gmail.com', 'gril8.jpg', '每天都要快樂的吃吃喝喝( ´∀｀ )う', '2023-07-23 14:49:11', '2023-07-23 14:49:11', '2023-07-23 14:49:11', 1),
(9, '郭偉誠', '吃飽才有力氣減肥?', '1234', '0939705444', 'foodeat88@msn.com', 'man9.jpg', '分享美食，記錄當下，這94人生。', '2023-07-23 14:49:11', '2023-07-23 14:49:11', '2023-07-23 14:49:11', 1),
(10, '楊冠廷', '阿罵養大的', '', '0953232912', 'cash99@hotmail.com', 'man10.jpg', 'IG帳號@cash99\r\n?紀錄三餐或覺得好吃的食物\r\n?喜歡歡迎按讚追蹤收藏分享(*‘∀‘)～?\r\n', '2023-07-23 15:05:49', '2023-07-31 13:44:04', '2023-07-23 15:05:49', 1),
(11, '娜塔莎', '地方吃貨媽媽', '1234', '0932178861', 'natasha@gmail.com', 'gril1.jpg', '歡迎追蹤IG/FB\r\n-->natasha@gmail.com\r\n希望你也喜歡我的文章\r\n幫我按讚/追蹤/分享\r\n讓更多人知道更多美食', '2023-07-23 15:05:49', '2023-07-23 15:05:49', '2023-07-23 15:05:49', 1),
(12, '莫妮卡', 'Monica', '1234', '0930826564', 'monica0001@gmail.com', 'gril12.jpg', '', '2023-07-23 15:44:36', '2023-07-23 15:44:36', '2023-07-23 15:44:36', 1),
(13, '郭志文', 'Conner', '1234', '0913687576', 'conner1234@gmail.com', 'man13.jpg', '', '2023-07-23 15:44:36', '2023-07-23 15:44:36', '2023-07-23 15:44:36', 1),
(14, '菲利普', 'PHILIP', '1234', '0968138883', 'philip@yahoo.com.tw', 'man14.jpg', '', '2023-07-23 15:50:31', '2023-07-23 15:50:31', '2023-07-23 15:50:31', 1),
(15, '高柏成', '快瘋惹', '1234', '0938243285', '1234@gmail.com', NULL, '', '2023-07-23 15:50:31', '2023-07-23 15:50:31', '2023-07-23 15:50:31', 1),
(16, '李佩珊', '姍姍來遲', '1234', '0963158113', 'shasha@gmail.com', 'gril16.jpg', '', '2023-07-25 09:00:31', '2023-07-25 09:00:31', '2023-07-25 09:00:31', 1),
(17, '海倫', 'HELE', '1234', '0963342619', 'hele123@gmail.com', 'gril16.jpg', '', '2023-07-23 16:00:42', '2023-07-23 16:00:42', '2023-07-23 16:00:42', 1),
(18, '陳建宏', '建宏艾登', '1234', '0931057511', 'AIDEN@gmail.com', NULL, '艾爾登的DLC甚麼時候出????', '2023-07-23 16:05:24', '2023-07-23 16:05:24', '2023-07-23 16:05:24', 1),
(19, '羽柴秀吉', '?猴子?', '1234', '0917797227', 'hashibahideyoshi@yahoo.com.jp', 'man19.jpg', '?吱吱~吱吱?吱吱吱吱~?吱吱~吱吱?', '2023-07-23 16:05:24', '2023-07-23 16:05:24', '2023-07-23 16:05:24', 1),
(20, '馬黑休', '小黑', '1234', '0934270783', 'india@gmail.com', NULL, '', '2023-07-23 16:17:23', '2023-07-23 16:17:23', '2023-07-23 16:17:23', 1),
(21, '李大廷', '大廷哥', '1234', '0954658347', 'korea@gmail.com', 'man21.jpg', '', '2023-07-23 16:17:23', '2023-07-28 17:57:21', '2023-07-23 16:17:23', 1),
(22, '蘇映如', 'Julia', '1234', '0912345678', 'yingjumr@gmail.com', '1696830486817.jpg', '', '2023-07-25 08:58:56', '2023-08-02 12:58:24', '2023-07-25 08:58:56', 1),
(35, '羅德忠', '我是VIP', '1234', '0922222222', 'vip888@gmail.com', NULL, '', '2023-07-26 14:21:00', '2023-07-26 14:21:00', '2023-07-26 14:21:00', 1),
(36, '焱光秀', '明智的選擇', '1234', '0933333333', 'vip666@gmail.com', 'man6.jpg', '', '2023-07-26 14:31:26', '2023-07-26 14:31:26', '2023-07-26 14:31:26', 1),
(37, '羅文嘉', '少林方丈', '1234', '0933333333', 'seafood9527@hotmail.com', NULL, '', '2023-07-26 14:55:02', '2023-07-26 14:55:02', '2023-07-26 14:55:02', 1),
(38, '王杰克', 'Jake吃吃喝喝', '1234', '0956261952', 'jake123@gmail.com', '1690358334.jpg', '', '2023-07-26 15:58:54', '2023-07-26 15:58:54', '2023-07-26 15:58:54', 1),
(39, '王香蕉', '香蕉君', '1234', '0912943119', 'banana@gmail.com', '1690528397.png', '123', '2023-07-28 15:13:17', '2023-07-28 18:04:17', '2023-07-28 15:13:17', 1),
(40, '李可可', '可可', '1234', '0986404302', 'coco@gmail.com', 'gril16.jpg', '1', '2023-07-30 16:11:56', '2023-08-02 11:51:20', '2023-07-30 16:11:56', 1),
(45, '????', '????', '123456789', '0912345676', 'aaaa123@aa.com', NULL, '', '2023-10-12 11:25:11', '2023-10-12 11:25:11', '0000-00-00 00:00:00', 1),
(46, '????', '????', '123456789', '0912345676', 'aaaa123@aa.com', NULL, '', '2023-10-12 11:25:17', '2023-10-12 11:25:17', '0000-00-00 00:00:00', 1),
(47, '????', '????', '123456789', '0912345666', '123@aa.com', NULL, '', '2023-10-12 11:48:28', '2023-10-12 11:48:28', '0000-00-00 00:00:00', 1),
(48, '????', '????', '11111111', '0912345676', 'will8086@gmail.com', NULL, '', '2023-10-12 12:52:21', '2023-10-12 12:52:21', '0000-00-00 00:00:00', 1),
(49, '????', '????', '11111111', '0912345676', 'will8086@gmail.com', NULL, '', '2023-10-12 13:00:10', '2023-10-12 13:00:10', '0000-00-00 00:00:00', 1),
(50, '測試測試', 'testtest', '123456789', '0912345676', '123@gg.com', NULL, '', '2023-10-12 13:03:51', '2023-10-12 13:03:51', '0000-00-00 00:00:00', 1),
(51, '測試測試', 'testtest', '123456789', '0912345676', '123@gg.com', NULL, '', '2023-10-12 13:29:00', '2023-10-12 13:29:00', '0000-00-00 00:00:00', 1),
(52, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:43:01', '2023-10-12 15:43:01', '0000-00-00 00:00:00', 1),
(53, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:46:06', '2023-10-12 15:46:06', '0000-00-00 00:00:00', 1),
(54, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:49:24', '2023-10-12 15:49:24', '0000-00-00 00:00:00', 1),
(55, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:50:01', '2023-10-12 15:50:01', '0000-00-00 00:00:00', 1),
(56, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:50:52', '2023-10-12 15:50:52', '0000-00-00 00:00:00', 1),
(57, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:52:07', '2023-10-12 15:52:07', '0000-00-00 00:00:00', 1),
(58, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 15:56:45', '2023-10-12 15:56:45', '0000-00-00 00:00:00', 1),
(59, '????', '????', '123456789', '0912345666', '13@aaa.com', NULL, '', '2023-10-12 16:05:15', '2023-10-12 16:05:15', '0000-00-00 00:00:00', 1),
(60, '????', '????', '123456789', '0912345666', '13@aaa.com', 'a8229899-a570-4048-a85b-ce6e241198e6.jpg', '', '2023-10-12 16:14:30', '2023-10-12 16:14:30', '0000-00-00 00:00:00', 1),
(61, '????', '????', '123456789', '0912345677', 'wil123@gmail.com', NULL, '', '2023-10-12 16:16:04', '2023-10-12 16:16:04', '0000-00-00 00:00:00', 1),
(62, '測試黑人哥', '黑人哥', '123456789', '0912345665', 'a12345@yahoo.com', NULL, '', '2023-10-12 16:20:42', '2023-10-12 16:20:42', '0000-00-00 00:00:00', 1),
(63, '測試黑人哥', '黑人哥', '123456789', '0912345665', 'a12345@yahoo.com', NULL, '', '2023-10-12 16:22:45', '2023-10-12 16:22:45', '0000-00-00 00:00:00', 1),
(64, '測試黑人哥', '黑人哥', '123456789', '0912345665', 'a12345@yahoo.com', '13de8360-c889-427d-b5ee-089f4bd6f854.webp', '', '2023-10-12 16:23:10', '2023-10-12 16:23:10', '0000-00-00 00:00:00', 1),
(65, '測試測試', 'WOWO', '123456789', '0912345555', '231@yahoo.com', 'd101865f-24c2-46c1-9ccd-c401f8fcacb7.jpg', '', '2023-10-13 14:03:09', '2023-10-13 14:03:09', '0000-00-00 00:00:00', 1),
(66, '還是測試', 'WOWO', '123456789', '0912345444', '123@gg.com', 'adf82ea4-33b2-4863-95e2-dcafb74df6d0.webp', '', '2023-10-13 14:10:18', '2023-10-13 14:10:18', '0000-00-00 00:00:00', 1),
(67, '我好棒', '棒棒', '123456789', '0912345333', 'good123@gmail.com', '33f589f7-c0e1-4c74-b485-b321046317c4.webp', '', '2023-10-13 14:12:23', '2023-10-13 14:12:23', '0000-00-00 00:00:00', 1),
(68, '12346', 'WOWO', '123456789', '0912345444', 'will8086@gmail.com', 'c52750b2-81cc-4106-bc08-0d7736a27889.jpg', '', '2023-10-13 14:41:54', '2023-10-13 14:41:54', '0000-00-00 00:00:00', 1),
(69, '12346', 'WOWO', '123456789', '0912345333', '123@gg.com', NULL, '', '2023-10-13 16:04:08', '2023-10-13 16:04:08', '0000-00-00 00:00:00', 1),
(70, '12346', 'WOWO', '123456789', '0912345333', '123456@gmail.com', NULL, '', '2023-10-13 16:06:35', '2023-10-13 16:06:35', '0000-00-00 00:00:00', 1),
(71, '測試測試', '測試君', '123456789', '0912345444', '123@aa.com', NULL, '', '2023-10-13 16:08:13', '2023-10-13 16:08:13', '0000-00-00 00:00:00', 1),
(72, '測試測試', '測試君2', '123456789', '0912345111', 'test@qq.com', NULL, '', '2023-10-13 16:17:56', '2023-10-13 16:17:56', '0000-00-00 00:00:00', 1),
(73, '成功', '成功君', '123456789', '0912345444', '1235@yahoo.com', '8bb75b99-23a2-4aec-9eb0-e50d424f7d73.webp', '', '2023-10-13 16:23:34', '2023-10-13 16:23:34', '0000-00-00 00:00:00', 1),
(74, '測試測試', 'WOWO', '123456789', '0912345111', '123456@gmail.com', NULL, '', '2023-10-13 16:48:06', '2023-10-13 16:48:06', '0000-00-00 00:00:00', 1),
(75, '測試測試', '測試甲', '123456789', '0912345123', 'test1@aa.com', 'a6f2d339-56eb-4f56-9a7c-d576eeef02a0.jpg', '', '2023-10-14 09:04:49', '2023-10-14 09:04:49', '0000-00-00 00:00:00', 1),
(76, '測試測試', '測試甲', '123456789', '0912345123', 'test1@aa.com', '92d655bc-6cf3-4aa8-87c1-9e2da8b82e10.jpg', '', '2023-10-14 09:10:27', '2023-10-14 09:10:27', '0000-00-00 00:00:00', 1),
(77, '測試測試', '測試甲', '123456789', '0912345123', 'test1@aa.com', '2acd5ee9-cbc9-4677-ae77-1b21f4b5f98c.jpg', '', '2023-10-14 09:12:35', '2023-10-14 09:12:35', '0000-00-00 00:00:00', 1),
(78, '測試測試', '測試甲', '123456789', '0912345123', 'test1@aa.com', 'cc7ee6be-81fd-4152-8158-2adefa750f5a.jpg', '', '2023-10-14 09:17:39', '2023-10-14 09:17:39', '0000-00-00 00:00:00', 1),
(79, '測試測試', '測試乙', '123456789', '0912345113', 'test@aa.com', '7df359b7-55e9-465f-a72c-e057a71592a1.jpg', '', '2023-10-14 09:27:01', '2023-10-14 09:27:01', '0000-00-00 00:00:00', 1),
(80, '測試測試', '測試乙', '123456789', '0912345113', 'test@aa.com', '199f7337-505e-447c-87ce-ac32679ba20d.jpg', '', '2023-10-14 09:27:46', '2023-10-14 09:27:46', '0000-00-00 00:00:00', 1),
(81, '測試測試', '測試乙', '123456789', '0912345113', 'test@aa.com', '0a781a17-0f01-4bbd-8690-4a069bda0af1.jpg', '', '2023-10-14 09:30:10', '2023-10-14 09:30:10', '0000-00-00 00:00:00', 1),
(82, '測試測試', '測試乙', '123456789', '0912345113', 'test@aa.com', 'f1c4fad9-9ce3-4726-8faa-347a6faf85dc.jpg', '', '2023-10-14 09:30:15', '2023-10-14 09:30:15', '0000-00-00 00:00:00', 1),
(83, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:07:12', '2023-10-14 10:07:12', '0000-00-00 00:00:00', 1),
(84, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:07:18', '2023-10-14 10:07:18', '0000-00-00 00:00:00', 1),
(85, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:18:22', '2023-10-14 10:18:22', '0000-00-00 00:00:00', 1),
(86, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:20:12', '2023-10-14 10:20:12', '0000-00-00 00:00:00', 1),
(87, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:20:26', '2023-10-14 10:20:26', '0000-00-00 00:00:00', 1),
(88, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:21:00', '2023-10-14 10:21:00', '0000-00-00 00:00:00', 1),
(89, '測試測試', 'WOWO', '123456789', '0912312345', '123@gg.com', NULL, '', '2023-10-14 10:27:37', '2023-10-14 10:27:37', '0000-00-00 00:00:00', 1),
(90, '測試測試', '測試丁', '123456789', '0912345111', 'a12@qq.com', 'd3e76c6d-d52a-498f-9f00-b79522521cbc.jpg', '', '2023-10-14 10:28:45', '2023-10-14 10:28:45', '0000-00-00 00:00:00', 1),
(91, '測試測試', '測試丁', '123456789', '0912345111', 'a12@qq.com', 'e3577bfe-cfa6-45fe-814c-84520cc093cb.jpg', '', '2023-10-14 10:28:49', '2023-10-14 10:28:49', '0000-00-00 00:00:00', 1),
(92, '測試測試', '測試丁', '123456789', '0912345111', 'a12@qq.com', 'bae37a6c-e685-4c32-94d0-abd80c1be241.jpg', '', '2023-10-14 10:31:05', '2023-10-14 10:31:05', '0000-00-00 00:00:00', 1),
(93, '測試測試', 'WOWO', '123456789', '0912345666', 'a123456789@qq.com', NULL, '', '2023-10-14 10:44:51', '2023-10-14 10:44:51', '0000-00-00 00:00:00', 1),
(94, '????', '????', '12345678', '0912345111', '123@aa.com', NULL, '', '2023-10-14 10:55:43', '2023-10-14 10:55:43', '0000-00-00 00:00:00', 1),
(95, '測試測試', 'WOWO', '12345678', '0912345666', 'q123@aa.com', NULL, '', '2023-10-14 11:01:33', '2023-10-14 11:01:33', '0000-00-00 00:00:00', 1),
(96, '測試測試', 'WOWO', '12345678', '0912345666', 'q123@aa.com', NULL, '', '2023-10-14 11:12:08', '2023-10-14 11:12:08', '0000-00-00 00:00:00', 1),
(97, '????', '123456798', '123456789', '0912345111', 'a123@gmail.com', '1ea3b188-885f-472b-a8d4-107f8f25f721.jpg', '', '2023-10-14 11:51:42', '2023-10-14 11:51:42', '0000-00-00 00:00:00', 1),
(98, '張丹喬', 'WOWO', '123456789', '0912345661', 'will8086@gmail.com', '4e45e7d8-69a7-4bad-8381-791f959297b2.jpg', '', '2023-10-17 10:35:57', '2023-10-17 10:35:57', '0000-00-00 00:00:00', 1),
(99, '張好爛', '我就爛', '123456789', '0912445566', 'gomi@qq.com', '19c59388-3b45-4e00-886b-feb8458fc172.webp', '', '2023-10-17 12:54:31', '2023-10-17 12:54:31', '0000-00-00 00:00:00', 1),
(100, '測試測試', 'WOWO', '123456789', '0912345888', 'q123456@gmail.com', '43526cec-d230-47b8-a78b-1f9f623a3d0e.jpg', '', '2023-10-17 14:42:14', '2023-10-17 14:42:14', '0000-00-00 00:00:00', 1),
(101, '還是測試', 'WOWO', '123456789', '0912344444', 'a125@gmail.com', '4e2c1b0c-3bf3-4b36-bbdc-e35275dc1b6f.jpg', '', '2023-10-17 15:46:29', '2023-10-17 15:46:29', '0000-00-00 00:00:00', 1),
(102, '測試測試', 'WOWO', '123456789', '0912345677', 'a1123@yahoo.com', NULL, '', '2023-10-17 16:21:25', '2023-10-17 16:21:25', '0000-00-00 00:00:00', 1),
(103, '測試測試', 'WOWO', '123456789', '0912388888', 'a1235@gmail.com', NULL, '', '2023-10-17 16:52:02', '2023-10-17 16:52:02', '0000-00-00 00:00:00', 1),
(104, '測試測試', 'WOWO', '123456789', '0922334456', 'a12345@yahoo.com', '3afcfa6a-f874-4a2e-8d5c-2a37d86501f3.jpg', '', '2023-10-17 16:54:08', '2023-10-17 16:54:08', '0000-00-00 00:00:00', 1),
(105, '測試測試', 'test哥', '123456789', '0966666666', 's123@gmail.com', '774fbfba-b232-406d-8bbf-8f9cafc68493.jpg', '', '2023-10-17 17:03:39', '2023-10-17 17:03:39', '0000-00-00 00:00:00', 1),
(106, '測試測試', 'test哥', '123456789', '0966666688', 's123@gmail.com', '0e389ea4-82dd-4ba5-840f-563706d1cd92.jpg', '', '2023-10-17 17:09:30', '2023-10-17 17:09:30', '0000-00-00 00:00:00', 1),
(107, '測試測試1', 'test哥1', '123456789', '0966666600', 's1231@gmail.com', '1c77f4d8-85c8-400c-86b1-5e6077e37948.jpg', '', '2023-10-17 17:14:08', '2023-10-17 17:14:08', '0000-00-00 00:00:00', 1),
(108, '測試測試2', 'WOWO2', '123456789', '0912121213', 'q125@gamil.com', '320d1cb7-812b-4542-bd45-cc4414a0fdf4.jpg', '', '2023-10-17 17:16:54', '2023-10-17 17:16:54', '0000-00-00 00:00:00', 1),
(109, '測試測試', 'WOWO', '123456789', '0912345666', 'a123@gmail.com', NULL, '', '2023-10-18 20:50:29', '2023-10-18 20:50:29', '0000-00-00 00:00:00', 1),
(110, '測試測試', 'WOWO', '123456789', '0912345444', 'test2@aa.com', NULL, '', '2023-10-18 20:51:07', '2023-10-18 20:51:07', '0000-00-00 00:00:00', 1),
(111, '測試黑人哥', 'WOWO', '123456789', '0912345000', 'ww12@gmail.com', 'c2a556cc-c4a7-4f6f-b8e9-87e9a78ebf59.jpg', '', '2023-10-18 20:56:25', '2023-10-18 20:56:25', '0000-00-00 00:00:00', 1),
(112, '克克', '克克', '12345678', '0912346548', 'whatever@gmail.com', 'man6.jpg', '', '2023-10-19 10:02:20', '2023-10-19 10:02:20', '0000-00-00 00:00:00', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `user_tag`
--

CREATE TABLE `user_tag` (
  `user_tag_id` int(11) NOT NULL,
  `user_id` int(10) NOT NULL,
  `food_tag_id` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `user_tag`
--

INSERT INTO `user_tag` (`user_tag_id`, `user_id`, `food_tag_id`) VALUES
(3, 2, 2),
(4, 2, 24),
(5, 2, 19),
(6, 2, 28),
(26, 39, 6),
(27, 39, 22),
(28, 40, 1),
(29, 40, 22),
(30, 22, 4),
(33, 45, 2),
(34, 45, 1),
(70, 104, 1),
(72, 107, 1),
(74, 108, 3),
(75, 111, 6),
(77, 112, 1),
(78, 112, 2),
(79, 112, 3),
(80, 112, 4),
(81, 112, 5),
(82, 112, 6),
(83, 1, 2),
(84, 1, 3),
(85, 1, 4);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`book_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `restaurant_id` (`restaurant_id`);

--
-- 資料表索引 `collection`
--
ALTER TABLE `collection`
  ADD PRIMARY KEY (`collection_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `product_id` (`product_id`);

--
-- 資料表索引 `followers`
--
ALTER TABLE `followers`
  ADD PRIMARY KEY (`followers_id`),
  ADD KEY `user_id_followed` (`user_id_followed`),
  ADD KEY `user_id_following` (`user_id_following`);

--
-- 資料表索引 `food_tag`
--
ALTER TABLE `food_tag`
  ADD PRIMARY KEY (`food_tag_id`);

--
-- 資料表索引 `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`like_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `post_id` (`post_id`);

--
-- 資料表索引 `menu_img`
--
ALTER TABLE `menu_img`
  ADD PRIMARY KEY (`menu_img_id`),
  ADD KEY `restaurant_id` (`restaurant_id`);

--
-- 資料表索引 `oder_detail`
--
ALTER TABLE `oder_detail`
  ADD PRIMARY KEY (`orderproduct_id`),
  ADD KEY `order_id` (`order_id`),
  ADD KEY `product_id` (`product_id`);

--
-- 資料表索引 `order_general`
--
ALTER TABLE `order_general`
  ADD PRIMARY KEY (`order_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`post_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `post_restaurant_id` (`post_restaurant_id`);

--
-- 資料表索引 `post_comment`
--
ALTER TABLE `post_comment`
  ADD PRIMARY KEY (`post_comment_id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `post_favorite`
--
ALTER TABLE `post_favorite`
  ADD PRIMARY KEY (`post_favorite_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `post_id` (`post_id`);

--
-- 資料表索引 `post_food_tag`
--
ALTER TABLE `post_food_tag`
  ADD PRIMARY KEY (`post_food_tag_id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `food_tag_id` (`food_tag_id`);

--
-- 資料表索引 `post_image`
--
ALTER TABLE `post_image`
  ADD PRIMARY KEY (`post_image_id`),
  ADD KEY `post_id` (`post_id`);

--
-- 資料表索引 `post_restaurant`
--
ALTER TABLE `post_restaurant`
  ADD PRIMARY KEY (`post_restaurant_id`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`product_id`),
  ADD KEY `product_type_id` (`product_type_id`),
  ADD KEY `product_type_list_id` (`product_type_list_id`);

--
-- 資料表索引 `product_img`
--
ALTER TABLE `product_img`
  ADD PRIMARY KEY (`product_img_id`),
  ADD KEY `product_id` (`product_id`);

--
-- 資料表索引 `product_item`
--
ALTER TABLE `product_item`
  ADD PRIMARY KEY (`item_id`);

--
-- 資料表索引 `product_item_detail`
--
ALTER TABLE `product_item_detail`
  ADD PRIMARY KEY (`product_item_id`),
  ADD KEY `item_id` (`item_id`),
  ADD KEY `product_id` (`product_id`);

--
-- 資料表索引 `product_type`
--
ALTER TABLE `product_type`
  ADD PRIMARY KEY (`product_type_id`);

--
-- 資料表索引 `product_type_list`
--
ALTER TABLE `product_type_list`
  ADD PRIMARY KEY (`product_type_list_id`),
  ADD KEY `product_type_id` (`product_type_id`);

--
-- 資料表索引 `restaurant_opening_hours`
--
ALTER TABLE `restaurant_opening_hours`
  ADD PRIMARY KEY (`id`),
  ADD KEY `restaurant_id` (`restaurant_id`);

--
-- 資料表索引 `restaurant_user`
--
ALTER TABLE `restaurant_user`
  ADD PRIMARY KEY (`restaurant_id`);

--
-- 資料表索引 `r_feature`
--
ALTER TABLE `r_feature`
  ADD PRIMARY KEY (`r_feature_id`),
  ADD KEY `restaurant_id` (`restaurant_id`);

--
-- 資料表索引 `r_food_tag`
--
ALTER TABLE `r_food_tag`
  ADD PRIMARY KEY (`r_food_tag_id`),
  ADD KEY `restaurant_id` (`restaurant_id`,`food_tag_id`),
  ADD KEY `food_tag_id` (`food_tag_id`);

--
-- 資料表索引 `r_img`
--
ALTER TABLE `r_img`
  ADD PRIMARY KEY (`r_img_id`),
  ADD KEY `restaurant_id` (`restaurant_id`);

--
-- 資料表索引 `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`session_id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`);

--
-- 資料表索引 `user_tag`
--
ALTER TABLE `user_tag`
  ADD PRIMARY KEY (`user_tag_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `food_tag_id` (`food_tag_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `book`
--
ALTER TABLE `book`
  MODIFY `book_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `collection`
--
ALTER TABLE `collection`
  MODIFY `collection_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=152;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `followers`
--
ALTER TABLE `followers`
  MODIFY `followers_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `food_tag`
--
ALTER TABLE `food_tag`
  MODIFY `food_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `likes`
--
ALTER TABLE `likes`
  MODIFY `like_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `menu_img`
--
ALTER TABLE `menu_img`
  MODIFY `menu_img_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `oder_detail`
--
ALTER TABLE `oder_detail`
  MODIFY `orderproduct_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post`
--
ALTER TABLE `post`
  MODIFY `post_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post_comment`
--
ALTER TABLE `post_comment`
  MODIFY `post_comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post_favorite`
--
ALTER TABLE `post_favorite`
  MODIFY `post_favorite_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post_food_tag`
--
ALTER TABLE `post_food_tag`
  MODIFY `post_food_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=155;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post_image`
--
ALTER TABLE `post_image`
  MODIFY `post_image_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=149;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post_restaurant`
--
ALTER TABLE `post_restaurant`
  MODIFY `post_restaurant_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=68;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_img`
--
ALTER TABLE `product_img`
  MODIFY `product_img_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=277;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_item`
--
ALTER TABLE `product_item`
  MODIFY `item_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_item_detail`
--
ALTER TABLE `product_item_detail`
  MODIFY `product_item_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_type`
--
ALTER TABLE `product_type`
  MODIFY `product_type_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_type_list`
--
ALTER TABLE `product_type_list`
  MODIFY `product_type_list_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `restaurant_opening_hours`
--
ALTER TABLE `restaurant_opening_hours`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `restaurant_user`
--
ALTER TABLE `restaurant_user`
  MODIFY `restaurant_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `r_feature`
--
ALTER TABLE `r_feature`
  MODIFY `r_feature_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `r_food_tag`
--
ALTER TABLE `r_food_tag`
  MODIFY `r_food_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `r_img`
--
ALTER TABLE `r_img`
  MODIFY `r_img_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=113;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_tag`
--
ALTER TABLE `user_tag`
  MODIFY `user_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `book`
--
ALTER TABLE `book`
  ADD CONSTRAINT `book_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `book_ibfk_2` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `collection`
--
ALTER TABLE `collection`
  ADD CONSTRAINT `collection_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `collection_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`);

--
-- 資料表的限制式 `followers`
--
ALTER TABLE `followers`
  ADD CONSTRAINT `followers_ibfk_1` FOREIGN KEY (`user_id_followed`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `followers_ibfk_2` FOREIGN KEY (`user_id_following`) REFERENCES `user` (`user_id`);

--
-- 資料表的限制式 `likes`
--
ALTER TABLE `likes`
  ADD CONSTRAINT `likes_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `likes_ibfk_2` FOREIGN KEY (`post_id`) REFERENCES `post` (`post_id`);

--
-- 資料表的限制式 `menu_img`
--
ALTER TABLE `menu_img`
  ADD CONSTRAINT `menu_img_ibfk_1` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `oder_detail`
--
ALTER TABLE `oder_detail`
  ADD CONSTRAINT `oder_detail_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  ADD CONSTRAINT `oder_detail_ibfk_2` FOREIGN KEY (`order_id`) REFERENCES `order_general` (`order_id`);

--
-- 資料表的限制式 `order_general`
--
ALTER TABLE `order_general`
  ADD CONSTRAINT `order_general_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`);

--
-- 資料表的限制式 `post`
--
ALTER TABLE `post`
  ADD CONSTRAINT `post_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`);

--
-- 資料表的限制式 `post_comment`
--
ALTER TABLE `post_comment`
  ADD CONSTRAINT `post_comment_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `post` (`post_id`),
  ADD CONSTRAINT `post_comment_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`);

--
-- 資料表的限制式 `post_favorite`
--
ALTER TABLE `post_favorite`
  ADD CONSTRAINT `post_favorite_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `post_favorite_ibfk_2` FOREIGN KEY (`post_id`) REFERENCES `post` (`post_id`);

--
-- 資料表的限制式 `post_food_tag`
--
ALTER TABLE `post_food_tag`
  ADD CONSTRAINT `post_food_tag_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `post` (`post_id`),
  ADD CONSTRAINT `post_food_tag_ibfk_2` FOREIGN KEY (`food_tag_id`) REFERENCES `food_tag` (`food_tag_id`);

--
-- 資料表的限制式 `post_image`
--
ALTER TABLE `post_image`
  ADD CONSTRAINT `post_image_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `post` (`post_id`);

--
-- 資料表的限制式 `product_img`
--
ALTER TABLE `product_img`
  ADD CONSTRAINT `product_img_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`);

--
-- 資料表的限制式 `product_item_detail`
--
ALTER TABLE `product_item_detail`
  ADD CONSTRAINT `product_item_detail_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  ADD CONSTRAINT `product_item_detail_ibfk_2` FOREIGN KEY (`item_id`) REFERENCES `product_item` (`item_id`);

--
-- 資料表的限制式 `product_type_list`
--
ALTER TABLE `product_type_list`
  ADD CONSTRAINT `product_type_list_ibfk_1` FOREIGN KEY (`product_type_id`) REFERENCES `product_type` (`product_type_id`);

--
-- 資料表的限制式 `restaurant_opening_hours`
--
ALTER TABLE `restaurant_opening_hours`
  ADD CONSTRAINT `restaurant_opening_hours_ibfk_1` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `r_feature`
--
ALTER TABLE `r_feature`
  ADD CONSTRAINT `r_feature_ibfk_1` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `r_food_tag`
--
ALTER TABLE `r_food_tag`
  ADD CONSTRAINT `r_food_tag_ibfk_1` FOREIGN KEY (`food_tag_id`) REFERENCES `food_tag` (`food_tag_id`),
  ADD CONSTRAINT `r_food_tag_ibfk_2` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `r_img`
--
ALTER TABLE `r_img`
  ADD CONSTRAINT `r_img_ibfk_1` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurant_user` (`restaurant_id`);

--
-- 資料表的限制式 `user_tag`
--
ALTER TABLE `user_tag`
  ADD CONSTRAINT `user_tag_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `user_tag_ibfk_2` FOREIGN KEY (`food_tag_id`) REFERENCES `food_tag` (`food_tag_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
